read32Bit = memory.readdwordunsigned
read16Bit = memory.readword
read8Bit = memory.readbyte
rshift = bit.rshift
lshift = bit.lshift
band = bit.band
bxor = bit.bxor
bor = bit.bor
floor = math.floor

local JUMP_DATA = {
 {0x6C078965, 0x269EC3}, {0x54341D9, 0x55AE9CB2}, {0x285E9F1, 0xC910A194}, {0xAE3294E1, 0x4EAC71E8},
 {0x5A78EDC1, 0x1566AED0}, {0x75BEEB81, 0x592709A0}, {0x56221701, 0x6068C340}, {0xCA552E01, 0x98DC4680},
 {0x28EE5C01, 0x2EE38D00}, {0x82ECB801, 0x3A731A00}, {0xCA197001, 0x27963400}, {0xA532E001, 0x19EC6800},
 {0x8E65C001, 0x5ED8D000}, {0x2CCB8001, 0x69B1A000}, {0x99970001, 0x83634000}, {0x332E0001, 0xC6C68000},
 {0x665C0001, 0x8D8D0000}, {0xCCB80001, 0x1B1A0000}, {0x99700001, 0x36340000}, {0x32E00001, 0x6C680000},
 {0x65C00001, 0xD8D00000}, {0xCB800001, 0xB1A00000}, {0x97000001, 0x63400000}, {0x2E000001, 0xC6800000},
 {0x5C000001, 0x8D000000}, {0xB8000001, 0x1A000000}, {0x70000001, 0x34000000}, {0xE0000001, 0x68000000},
 {0xC0000001, 0xD0000000}, {0x80000001, 0xA0000000}, {0x1, 0x40000000}, {0x1, 0x80000000}}

local natureNamesList = {
 "勤奋", "怕寂寞", "勇敢", "固执", "顽皮",
 "大胆", "坦率", "悠闲", "淘气", "乐天",
 "胆小", "急躁", "认真", "爽朗", "天真",
 "内敛", "慢吞吞", "冷静", "害羞", "马虎",
 "温和", "温顺", "自大", "慎重", "浮躁"}

local HPTypeNamesList = {
 "格斗", "飞行", "毒", "地面",
 "岩石", "虫", "幽灵", "钢",
 "火", "水", "草", "电",
 "超能力", "冰", "龙", "恶"}

local speciesNamesList = {
 -- 第一世代
 "妙蛙种子", "妙蛙草", "妙蛙花", "小火龙", "火恐龙", "喷火龙", "杰尼龟", "卡咪龟", "水箭龟",
 "绿毛虫", "铁甲蛹", "巴大蝶", "独角虫", "铁壳蛹", "大针蜂", "波波", "比比鸟", "大比鸟", "小拉达",
 "拉达", "烈雀", "大嘴雀", "阿柏蛇", "阿柏怪", "皮卡丘", "雷丘", "穿山鼠", "穿山王", "尼多兰",
 "尼多娜", "尼多后", "尼多朗", "尼多力诺", "尼多王", "皮皮", "皮可西", "六尾", "九尾",
 "胖丁", "胖可丁", "超音蝠", "大嘴蝠", "走路草", "臭臭花", "霸王花", "派拉斯", "派拉斯特", "毛球",
 "摩鲁蛾", "地鼠", "三地鼠", "喵喵", "猫老大", "可达鸭", "哥达鸭", "猴怪", "火暴猴", "卡蒂狗",
 "风速狗", "蚊香蝌蚪", "蚊香君", "蚊香泳士", "凯西", "勇基拉", "胡地", "腕力", "豪力", "怪力",
 "喇叭芽", "口呆花", "大食花", "玛瑙水母", "毒刺水母", "小拳石", "隆隆石", "隆隆岩", "小火马",
 "烈焰马", "呆呆兽", "呆壳兽", "小磁怪", "三合一磁怪", "大葱鸭", "嘟嘟", "嘟嘟利", "小海狮", "白海狮",
 "臭泥", "臭臭泥", "大舌贝", "刺甲贝", "鬼斯", "鬼斯通", "耿鬼", "大岩蛇", "催眠貘", "引梦貘人", "大钳蟹",
 "巨钳蟹", "霹雳电球", "顽皮雷弹", "蛋蛋", "椰蛋树", "卡拉卡拉", "嘎啦嘎啦", "飞腿郎", "快拳郎",
 "大舌头", "瓦斯弹", "双弹瓦斯", "独角犀牛", "钻角犀兽", "吉利蛋", "蔓藤怪", "袋兽", "墨海马", "海刺龙",
 "角金鱼", "金鱼王", "海星星", "宝石海星", "魔墙人偶", "飞天螳螂", "迷唇姐", "电击兽", "鸭嘴火兽", "凯罗斯",
 "肯泰罗", "鲤鱼王", "暴鲤龙", "拉普拉斯", "百变怪", "伊布", "水伊布", "雷伊布", "火伊布", "多边兽",
 "菊石兽", "多刺菊石兽", "化石盔", "镰刀盔", "化石翼龙", "卡比兽", "急冻鸟", "闪电鸟", "火焰鸟", "迷你龙",
 "哈克龙", "快龙", "超梦", "梦幻",
 -- 第二世代
 "菊草叶", "月桂叶", "大竺葵", "火球鼠", "火岩鼠", "火暴兽", "小锯鳄", "蓝鳄", "大力鳄",
 "尾立", "大尾立", "咕咕", "猫头夜鹰", "芭瓢虫", "安瓢虫", "圆丝蛛", "阿利多斯", "叉字蝠", "灯笼鱼",
 "电灯怪", "皮丘", "皮宝宝", "宝宝丁", "波克比", "波克基古", "天然雀", "天然鸟", "咩利羊", "茸茸羊", "电龙",
 "美丽花", "玛力露", "玛力露丽", "树才怪", "蚊香蛙皇", "毽子草", "毽子花", "毽子棉", "长尾怪手", "向日种子",
 "向日花怪", "蜻蜻蜓", "乌波", "沼王", "太阳伊布", "月亮伊布", "黑暗鸦", "呆呆王", "梦妖", "未知图腾",
 "果然翁", "麒麟奇", "榛果球", "佛烈托斯", "土龙弟弟", "天蝎", "大钢蛇", "布鲁", "布鲁皇",
 "千针鱼", "巨钳螳螂", "壶壶", "赫拉克罗斯", "狃拉", "熊宝宝", "圈圈熊", "熔岩虫", "熔岩蜗牛", "小山猪",
 "长毛猪", "太阳珊瑚", "铁炮鱼", "章鱼桶", "信使鸟", "巨翅飞鱼", "盔甲鸟", "戴鲁比", "黑鲁加",
 "刺龙王", "小小象", "顿甲", "多边兽Ⅱ", "惊角鹿", "图图犬", "无畏小子", "战舞郎", "迷唇娃", "电击怪",
 "鸭嘴宝宝", "大奶罐", "幸福蛋", "雷公", "炎帝", "水君", "幼基拉斯", "沙基拉斯", "班基拉斯", "洛奇亚", "凤王",
 "时拉比",
 -- 第三世代
 "木守宫", "森林蜥蜴", "蜥蜴王", "火稚鸡", "力壮鸡", "火焰鸡", "水跃鱼", "沼跃鱼", "巨沼怪",
 "土狼犬", "大狼犬", "蛇纹熊", "直冲熊", "刺尾虫", "甲壳茧", "狩猎凤蝶", "盾甲茧", "毒粉蛾", "莲叶童子",
 "莲帽小童", "乐天河童", "橡实果", "长鼻叶", "狡猾天狗", "傲骨燕", "大王燕", "长翅鸥", "大嘴鸥", "拉鲁拉丝",
 "奇鲁莉安", "沙奈朵", "溜溜糖球", "雨翅蛾", "蘑蘑菇", "斗笠菇", "懒人獭", "过动猿", "请假王",
 "土居忍士", "铁面忍者", "脱壳忍者", "咕妞妞", "吼爆弹", "爆音怪", "幕下力士", "铁掌力士", "露力丽", "朝北鼻",
 "向尾喵", "优雅猫", "勾魂眼", "大嘴娃", "可可多拉", "可多拉", "波士可多拉", "玛沙那", "恰雷姆", "落雷兽",
 "雷电兽", "正电拍拍", "负电拍拍", "电萤虫", "甜甜萤", "毒蔷薇", "溶食兽", "吞食兽", "利牙鱼", "巨牙鲨",
 "吼吼鲸", "吼鲸王", "呆火驼", "喷火驼", "煤炭龟", "跳跳猪", "噗噗猪", "晃晃斑", "大颚蚁", "超音波幼虫",
 "沙漠蜻蜓", "刺球仙人掌", "梦歌仙人掌", "青绵鸟", "七夕青鸟", "猫鼬斩", "饭匙蛇", "月石", "太阳岩", "泥泥鳅",
 "鲶鱼王", "龙虾小兵", "铁螯龙虾", "天秤偶", "念力土偶", "触手百合", "摇篮百合", "太古羽虫", "太古盔甲", "丑丑鱼",
 "美纳斯", "飘浮泡泡", "变隐龙", "怨影娃娃", "诅咒娃娃", "夜巡灵", "彷徨夜灵", "热带龙", "风铃铃", "阿勃梭鲁",
 "小果然", "雪童子", "冰鬼护", "海豹球", "海魔狮", "帝牙海狮", "珍珠贝", "猎斑鱼", "樱花鱼", "古空棘鱼",
 "爱心鱼", "宝贝龙", "甲壳龙", "暴飞龙", "铁哑铃", "金属怪", "巨金怪", "雷吉洛克", "雷吉艾斯", "雷吉斯奇鲁",
 "拉帝亚斯", "拉帝欧斯",  "盖欧卡", "固拉多", "烈空坐", "基拉祈", "代欧奇希斯",
 -- 第四世代
 "草苗龟", "树林龟", "土台龟", "小火焰猴", "猛火猴", "烈焰猴", "波加曼", "波皇子", "帝王拿波", "姆克儿",
 "姆克鸟", "姆克鹰", "大牙狸", "大尾狸", "圆法师", "音箱蟀", "小猫怪", "勒克猫", "伦琴猫", "含羞苞",
 "罗丝雷朵", "头盖龙", "战槌龙", "盾甲龙", "护城龙", "结草儿", "结草贵妇", "绅士蛾", "三蜜蜂", "蜂女王",
 "帕奇利兹", "泳圈鼬", "浮潜鼬", "樱花宝", "樱花儿", "无壳海兔", "海兔兽", "双尾怪手", "飘飘球", "随风球",
 "卷卷耳", "长耳兔", "梦妖魔", "乌鸦头头", "魅力喵", "东施喵", "铃铛响", "臭鼬噗", "坦克臭鼬", "铜镜怪",
 "青铜钟", "盆才怪", "魔尼尼", "小福蛋", "聒噪鸟", "花岩怪", "圆陆鲨", "尖牙陆鲨", "烈咬陆鲨", "小卡比兽",
 "利欧路", "路卡利欧", "沙河马", "河马兽", "钳尾蝎", "龙王蝎", "不良蛙", "毒骷蛙", "尖牙笼", "荧光鱼",
 "霓虹鱼", "小球飞鱼", "雪笠怪", "暴雪王", "玛狃拉", "自爆磁怪", "大舌舔", "超甲狂犀", "巨蔓藤",
 "电击魔兽", "鸭嘴炎兽", "波克基斯", "远古巨蜓", "叶伊布", "冰伊布", "天蝎王", "象牙猪", "多边兽Ｚ",
 "艾路雷朵", "大朝北鼻", "黑夜魔灵", "雪妖女", "洛托姆", "由克希", "艾姆利多", "亚克诺姆", "帝牙卢卡", "帕路奇亚", "席多蓝恩",
 "雷吉奇卡斯", "骑拉帝纳", "克雷色利亚", "霏欧纳", "玛纳霏", "达克莱伊", "谢米", "阿尔宙斯",
 -- 第五世代
 "比克提尼", "藤藤蛇", "青藤蛇", "君主蛇", "暖暖猪", "炒炒猪", "炎武王", "水水獭", "双刃丸", "大剑鬼", "探探鼠",
 "步哨鼠", "小约克", "哈约克", "长毛狗", "扒手猫", "酷豹", "花椰猴", "花椰猿", "爆香猴", "爆香猿",
 "冷水猴", "冷水猿", "食梦梦", "梦梦蚀", "豆豆鸽", "咕咕鸽", "高傲雉鸡", "斑斑马", "雷电斑马", "石丸子",
 "地幔岩", "庞岩怪", "滚滚蝙蝠", "心蝙蝠", "螺钉地鼠", "龙头地鼠", "差不多娃娃", "搬运小匠", "铁骨土人", "修建老匠",
 "圆蝌蚪", "蓝蟾蜍", "蟾蜍王", "投摔鬼", "打击鬼", "虫宝包", "宝包茧", "保姆虫", "百足蜈蚣", "车轮球",
 "蜈蚣王", "木棉球", "风妖精", "百合根娃娃", "裙儿小姐", "野蛮鲈鱼", "黑眼鳄", "混混鳄", "流氓鳄",
 "火红不倒翁", "达摩狒狒", "沙铃仙人掌", "石居蟹", "岩殿居蟹", "滑滑小子", "头巾混混", "象征鸟", "哭哭面具", "死神棺",
 "原盖海龟", "肋骨海龟", "始祖小鸟", "始祖大鸟", "破破袋", "灰尘山", "索罗亚", "索罗亚克", "泡沫栗鼠", "奇诺栗鼠",
 "哥德宝宝", "哥德小童", "哥德小姐", "单卵细胞球", "双卵细胞球", "人造细胞卵", "鸭宝宝", "舞天鹅", "迷你冰", "多多冰",
 "双倍多多冰", "四季鹿", "萌芽鹿", "电飞鼠", "盖盖虫", "骑士蜗牛", "哎呀球菇", "败露球菇", "轻飘飘", "胖嘟嘟",
 "保母曼波", "电电虫", "电蜘蛛", "种子铁球", "坚果哑铃", "齿轮儿", "齿轮组", "齿轮怪", "麻麻小鱼", "麻麻鳗",
 "麻麻鳗鱼王", "小灰怪", "大宇怪", "烛光灵", "灯火幽灵", "水晶灯火灵", "牙牙", "斧牙龙", "双斧战龙", "喷嚏熊", "冻原熊",
 "几何雪花", "小嘴蜗", "敏捷虫", "泥巴鱼", "功夫鼬", "师父鼬", "赤面龙", "泥偶小人", "泥偶巨人", "驹刀小兵",
 "劈斩司令", "爆炸头水牛", "毛头小鹰", "勇士雄鹰", "秃鹰丫头", "秃鹰娜", "熔蚁兽", "铁蚁", "单首龙", "双首暴龙",
 "三首恶龙", "燃烧虫", "火神蛾", "勾帕路翁", "代拉基翁", "毕力吉翁", "龙卷云", "雷电云", "莱希拉姆", "捷克罗姆",
 "土地云", "酋雷姆", "凯路迪欧", "美洛耶塔", "盖诺赛克特"}

local abilityNamesList = {
 -- 第三世代
 "恶臭", "降雨", "加速", "战斗盔甲", "结实", "湿气", "柔软", "沙隐", "静电",
 "蓄电", "储水", "迟钝", "无关天气", "复眼", "不眠", "变色", "免疫",
 "引火", "鳞粉", "我行我素", "吸盘", "威吓", "踩影", "粗糙皮肤", "神奇守护",
 "飘浮", "孢子", "同步", "恒净之躯", "自然回复", "避雷针", "天恩",
 "悠游自如", "叶绿素", "发光", "复制", "大力士", "毒刺", "精神力", "熔岩铠甲",
 "水幕", "磁力", "隔音", "雨盘", "扬沙", "压迫感", "厚脂肪", "早起",
 "火焰之躯", "逃跑", "锐利目光", "怪力钳", "捡拾", "懒惰", "活力", "迷人之躯", "正电", "负电",
 "阴晴不定", "黏着", "蜕皮", "毅力", "神奇鳞片", "污泥浆", "茂盛", "猛火", "激流",
 "虫之预感", "坚硬脑袋", "日照", "沙穴", "干劲", "白色烟雾", "瑜伽之力", "硬壳盔甲",
 "气闸",
 -- 第四世代
 "蹒跚", "电气引擎", "斗争心", "不屈之心", "雪隐", "贪吃鬼", "愤怒穴位", "轻装",
 "耐热", "单纯", "干燥皮肤", "下载", "铁拳", "毒疗", "适应力", "连续攻击", "湿润之躯",
 "太阳之力", "飞毛腿", "一般皮肤", "狙击手", "魔法防守", "无防守", "慢出", "技术高手", "叶子防守",
 "笨拙", "破格", "超幸运", "引爆", "危险预知", "预知梦", "纯朴", "有色眼镜", "过滤",
 "慢启动", "胆量", "引水", "冰冻之躯", "坚硬岩石", "降雪", "采蜜", "察觉", "舍身",
 "多属性", "花之礼", "梦魇",
 -- 第五世代
 "顺手牵羊", "强行", "唱反调", "紧张感", "不服输", "软弱", "诅咒之躯", "治愈之心", "友情防守",
 "碎裂铠甲", "重金属", "轻金属", "多重鳞片", "中毒激升", "受热激升", "收获", "心灵感应", "心情不定",
 "防尘", "毒手", "再生力", "健壮胸肌", "拨沙", "奇迹皮肤", "分析", "幻觉", "变身者",
 "穿透", "木乃伊", "自信过度", "正义之心", "胆怯", "魔法镜", "食草", "恶作剧之心", "沙之力",
 "铁刺", "达摩模式", "胜利之星", "涡轮火焰", "兆级电压"}

local pokemonAbilities = {
 [1] = {65, 34}, [2] = {65, 34}, [3] = {65, 34}, [4] = {66, 94}, [5] = {66, 94}, [6] = {66, 94}, [7] = {67, 44}, [8] = {67, 44},
 [9] = {67, 44}, [10] = {19, 50}, [11] = {61, 61}, [12] = {14, 110}, [13] = {19, 50}, [14] = {61, 61}, [15] = {68, 97}, [16] = {51, 77, 145},
 [17] = {51, 77, 145}, [18] = {51, 77, 145}, [19] = {50, 62, 55}, [20] = {50, 62, 55}, [21] = {51, 97}, [22] = {51, 97}, [23] = {22, 61, 127},
 [24] = {22, 61, 127}, [25] = {9, 31}, [26] = {9, 31}, [27] = {8, 146}, [28] = {8, 146}, [29] = {38, 79, 55}, [30] = {38, 79, 55}, [31] = {38, 79, 125},
 [32] = {38, 79, 55}, [33] = {38, 79, 55}, [34] = {38, 79, 125}, [35] = {56, 98, 132}, [36] = {56, 98, 109}, [37] = {18, 70}, [38] = {18, 70},
 [39] = {56, 132}, [40] = {56, 119}, [41] = {39, 151}, [42] = {39, 151}, [43] = {34, 50}, [44] = {34, 1}, [45] = {34, 27}, [46] = {27, 87, 6},
 [47] = {27, 87, 6}, [48] = {14, 110, 50}, [49] = {19, 110, 147}, [50] = {8, 71, 159}, [51] = {8, 71, 159}, [52] = {53, 101, 127}, [53] = {7, 101, 127},
 [54] = {6, 13, 33}, [55] = {6, 13, 33}, [56] = {72, 83, 128}, [57] = {72, 83, 128}, [58] = {22, 18, 154}, [59] = {22, 18, 154}, [60] = {11, 6, 33},
 [61] = {11, 6, 33}, [62] = {11, 6, 33}, [63] = {28, 39, 98}, [64] = {28, 39, 98}, [65] = {28, 39, 98}, [66] = {62, 99, 80}, [67] = {62, 99, 80},
 [68] = {62, 99, 80}, [69] = {34, 82}, [70] = {34, 82}, [71] = {34, 82}, [72] = {29, 64, 44}, [73] = {29, 64, 44}, [74] = {69, 5, 8}, [75] = {69, 5, 8},
 [76] = {69, 5, 8}, [77] = {50, 18, 49}, [78] = {50, 18, 49}, [79] = {12, 20, 144}, [80] = {12, 20, 144}, [81] = {42, 5, 148}, [82] = {42, 5, 148},
 [83] = {51, 39, 128}, [84] = {50, 48, 77}, [85] = {50, 48, 77}, [86] = {47, 93, 115}, [87] = {47, 93, 115}, [88] = {1, 60, 143}, [89] = {1, 60, 143},
 [90] = {75, 92, 142}, [91] = {75, 92, 142}, [92] = {26}, [93] = {26}, [94] = {26}, [95] = {69, 5, 133}, [96] = {15, 108, 39}, [97] = {15, 108, 39},
 [98] = {52, 75, 125}, [99] = {52, 75, 125}, [100] = {43, 9, 106}, [101] = {43, 9, 106}, [102] = {34, 139}, [103] = {34, 139}, [104] = {69, 31, 4},
 [105] = {69, 31, 4}, [106] = {7, 120, 84}, [107] = {51, 89, 39}, [108] = {20, 12, 13}, [109] = {26}, [110] = {26}, [111] = {31, 69, 120}, [112] = {31, 69, 120},
 [113] = {30, 32, 131}, [114] = {34, 102, 144}, [115] = {48, 113, 39}, [116] = {33, 97, 6}, [117] = {38, 97, 6}, [118] = {33, 41, 31}, [119] = {33, 41, 31},
 [120] = {35, 30, 148}, [121] = {35, 30, 148}, [122] = {43, 111, 101}, [123] = {68, 101, 80}, [124] = {12, 108, 87}, [125] = {9, 72}, [126] = {49, 72},
 [127] = {52, 104, 153}, [128] = {22, 83, 125}, [129] = {33, 155}, [130] = {22, 153}, [131] = {11, 75, 93}, [132] = {7, 150}, [133] = {50, 91, 107},
 [134] = {11, 11, 93}, [135] = {10, 10, 95}, [136] = {18, 18, 62}, [137] = {36, 88, 148}, [138] = {33, 75, 133}, [139] = {33, 75, 133}, [140] = {33, 4, 133},
 [141] = {33, 4, 133}, [142] = {69, 46, 127}, [143] = {17, 47, 82}, [144] = {46, 81}, [145] = {46, 31}, [146] = {46, 49}, [147] = {61, 63}, [148] = {61, 63},
 [149] = {39, 136}, [150] = {46, 127}, [151] = {28}, [152] = {65, 102}, [153] = {65, 102}, [154] = {65, 102}, [155] = {66, 18}, [156] = {66, 18}, [157] = {66, 18},
 [158] = {67, 125}, [159] = {67, 125}, [160] = {67, 125}, [161] = {50, 51, 119}, [162] = {50, 51, 119}, [163] = {15, 51, 110}, [164] = {15, 51, 110},
 [165] = {68, 48, 155}, [166] = {68, 48, 89}, [167] = {68, 15, 97}, [168] = {68, 15, 97}, [169] = {39, 151}, [170] = {10, 35, 11}, [171] = {10, 35, 11}, [172] = {9, 31},
 [173] = {56, 98, 132}, [174] = {56, 132}, [175] = {55, 32, 105}, [176] = {55, 32, 105}, [177] = {28, 48, 156}, [178] = {28, 48, 156}, [179] = {9, 57},
 [180] = {9, 57}, [181] = {9, 57}, [182] = {34, 131}, [183] = {47, 37, 157}, [184] = {47, 37, 157}, [185] = {5, 69, 155}, [186] = {11, 6, 2}, [187] = {34, 102, 151},
 [188] = {34, 102, 151}, [189] = {34, 102, 151}, [190] = {50, 53, 92}, [191] = {34, 94, 48}, [192] = {34, 94, 48}, [193] = {3, 14, 119}, [194] = {6, 11, 109},
 [195] = {6, 11, 109}, [196] = {28, 28, 156}, [197] = {28, 28, 39}, [198] = {15, 105, 158}, [199] = {12, 20, 144}, [200] = {26}, [201] = {26}, [202] = {23, 140},
 [203] = {39, 48, 157}, [204] = {5, 142}, [205] = {5, 142}, [206] = {32, 50, 155}, [207] = {52, 8, 17}, [208] = {69, 5, 125}, [209] = {22, 50, 155},
 [210] = {22, 95, 155}, [211] = {38, 33, 22}, [212] = {68, 101, 135}, [213] = {5, 82, 126}, [214] = {68, 62, 153}, [215] = {39, 51, 124}, [216] = {53, 95, 118},
 [217] = {62, 95, 127}, [218] = {40, 49, 133}, [219] = {40, 49, 133}, [220] = {12, 81, 47}, [221] = {12, 81, 47}, [222] = {55, 30, 144}, [223] = {55, 97, 141},
 [224] = {21, 97, 141}, [225] = {72, 55, 15}, [226] = {33, 11, 41}, [227] = {51, 5, 133}, [228] = {48, 18, 127}, [229] = {48, 18, 127}, [230] = {33, 97, 6},
 [231] = {53, 8}, [232] = {5, 8}, [233] = {36, 88, 148}, [234] = {22, 119, 157}, [235] = {20, 101, 141}, [236] = {62, 80, 72}, [237] = {22, 101, 80},
 [238] = {12, 108, 93}, [239] = {9, 72}, [240] = {49, 72}, [241] = {47, 113, 157}, [242] = {30, 32, 131}, [243] = {46, 10}, [244] = {46, 18}, [245] = {46, 11},
 [246] = {62, 8}, [247] = {61, 61}, [248] = {45, 127}, [249] = {46, 136}, [250] = {46, 144}, [251] = {30}, [252] = {65, 84}, [253] = {65, 84}, [254] = {65, 84},
 [255] = {66, 3}, [256] = {66, 3}, [257] = {66, 3}, [258] = {67, 6}, [259] = {67, 6}, [260] = {67, 6}, [261] = {50, 95, 155}, [262] = {22, 95, 153},
 [263] = {53, 82, 95}, [264] = {53, 82, 95}, [265] = {19, 50}, [266] = {61, 61}, [267] = {68, 79}, [268] = {61, 61}, [269] = {19, 14}, [270] = {33, 44, 20},
 [271] = {33, 44, 20}, [272] = {33, 44, 20}, [273] = {34, 48, 124}, [274] = {34, 48, 124}, [275] = {34, 48, 124}, [276] = {62, 113}, [277] = {62, 113},
 [278] = {51, 44}, [279] = {51, 44}, [280] = {28, 36, 140}, [281] = {28, 36, 140}, [282] = {28, 36, 140}, [283] = {33, 44}, [284] = {22, 127}, [285] = {27, 90, 95},
 [286] = {27, 90, 101}, [287] = {54}, [288] = {72}, [289] = {54}, [290] = {14, 50}, [291] = {3, 151}, [292] = {25, 25}, [293] = {43, 155}, [294] = {43, 113},
 [295] = {43, 113}, [296] = {47, 62, 125}, [297] = {47, 62, 125}, [298] = {47, 37, 157}, [299] = {5, 42, 159}, [300] = {56, 96, 147}, [301] = {56, 96, 147},
 [302] = {51, 100, 158}, [303] = {52, 22, 125}, [304] = {5, 69, 134}, [305] = {5, 69, 134}, [306] = {5, 69, 134}, [307] = {74, 140}, [308] = {74, 140},
 [309] = {9, 31, 58}, [310] = {9, 31, 58}, [311] = {57}, [312] = {58}, [313] = {35, 68, 158}, [314] = {12, 110, 158}, [315] = {30, 38, 102}, [316] = {64, 60, 82},
 [317] = {64, 60, 82}, [318] = {24, 3}, [319] = {24, 3}, [320] = {41, 12, 46}, [321] = {41, 12, 46}, [322] = {12, 86, 20}, [323] = {40, 116, 83}, [324] = {73, 75},
 [325] = {47, 20, 82}, [326] = {47, 20, 82}, [327] = {20, 77, 126}, [328] = {52, 71, 125}, [329] = {26, 26, 26}, [330] = {26, 26, 26}, [331] = {8, 11}, [332] = {8, 11},
 [333] = {30, 13}, [334] = {30, 13}, [335] = {17, 137}, [336] = {61, 151}, [337] = {26}, [338] = {26}, [339] = {12, 107, 93}, [340] = {12, 107, 93}, [341] = {52, 75, 91},
 [342] = {52, 75, 91}, [343] = {26}, [344] = {26}, [345] = {21, 114}, [346] = {21, 114}, [347] = {4, 33}, [348] = {4, 33}, [349] = {33, 91}, [350] = {63, 56},
 [351] = {59}, [352] = {16}, [353] = {15, 119, 130}, [354] = {15, 119, 130}, [355] = {26}, [356] = {46}, [357] = {34, 94, 139}, [358] = {26}, [359] = {46, 105, 154},
 [360] = {23, 140}, [361] = {39, 115, 141}, [362] = {39, 115, 141}, [363] = {47, 115, 12}, [364] = {47, 115, 12}, [365] = {47, 115, 12}, [366] = {75, 155},
 [367] = {33, 41}, [368] = {33, 93}, [369] = {33, 69, 5}, [370] = {33, 93}, [371] = {69, 125}, [372] = {69, 142}, [373] = {22, 153}, [374] = {29, 135}, [375] = {29, 135},
 [376] = {29, 135}, [377] = {29, 5}, [378] = {29, 115}, [379] = {29, 135}, [380] = {26}, [381] = {26}, [382] = {2}, [383] = {70}, [384] = {76}, [385] = {32}, [386] = {46},
 [387] = {65, 75}, [388] = {65, 75}, [389] = {65, 75}, [390] = {66, 89}, [391] = {66, 89}, [392] = {66, 89}, [393] = {67, 128}, [394] = {67, 128}, [395] = {67, 128},
 [396] = {51, 51}, [397] = {22, 120}, [398] = {22, 120}, [399] = {86, 109, 141}, [400] = {86, 109, 141}, [401] = {61, 50}, [402] = {68, 101}, [403] = {79, 22, 62},
 [404] = {79, 22, 62}, [405] = {79, 22, 62}, [406] = {30, 38, 102}, [407] = {30, 38, 101}, [408] = {104, 125}, [409] = {104, 125}, [410] = {5, 43}, [411] = {5, 43},
 [412] = {61, 142}, [413] = {107, 142}, [414] = {68, 110}, [415] = {118, 55}, [416] = {46, 127}, [417] = {50, 53, 10}, [418] = {33, 41}, [419] = {33, 41}, [420] = {34},
 [421] = {122}, [422] = {60, 114, 159}, [423] = {60, 114, 159}, [424] = {101, 53, 92}, [425] = {106, 84, 138}, [426] = {106, 84, 138}, [427] = {50, 103, 7},
 [428] = {56, 103, 7}, [429] = {26}, [430] = {15, 105, 153}, [431] = {7, 20, 51}, [432] = {47, 20, 128}, [433] = {26}, [434] = {1, 106, 51}, [435] = {1, 106, 51},
 [436] = {26, 85, 134}, [437] = {26, 85, 134}, [438] = {5, 69, 155}, [439] = {43, 111, 101}, [440] = {30, 32, 132}, [441] = {51, 77, 145}, [442] = {46, 151},
 [443] = {8, 24}, [444] = {8, 24}, [445] = {8, 24}, [446] = {53, 47, 82}, [447] = {80, 39, 158}, [448] = {80, 39, 154}, [449] = {45, 159}, [450] = {45, 159},
 [451] = {4, 97, 51}, [452] = {4, 97, 51}, [453] = {107, 87, 143}, [454] = {107, 87, 143}, [455] = {26}, [456] = {33, 114, 41}, [457] = {33, 114, 41},
 [458] = {33, 11, 41}, [459] = {117, 43}, [460] = {117, 43}, [461] = {46, 46, 124}, [462] = {42, 5, 148}, [463] = {20, 12, 13}, [464] = {31, 116, 120},
 [465] = {34, 102, 144}, [466] = {78, 72}, [467] = {49, 72}, [468] = {55, 32, 105}, [469] = {3, 110, 119}, [470] = {102, 102, 34}, [471] = {81, 81, 115},
 [472] = {52, 8, 90}, [473] = {12, 81, 47}, [474] = {91, 88, 148}, [475] = {80, 80, 154}, [476] = {5, 42, 159}, [477] = {46}, [478] = {81, 81, 130}, [479] = {26},
 [480] = {26}, [481] = {26}, [482] = {26}, [483] = {46, 140}, [484] = {46, 140}, [485] = {18, 49}, [486] = {112}, [487] = {46, 140}, [488] = {26}, [489] = {93},
 [490] = {93}, [491] = {123}, [492] = {30}, [493] = {121}, [494] = {162}, [495] = {65, 65, 126}, [496] = {65, 65, 126}, [497] = {65, 65, 126}, [498] = {66, 66, 47},
 [499] = {66, 66, 47}, [500] = {66, 66, 120}, [501] = {67, 67, 75}, [502] = {67, 67, 75}, [503] = {67, 67, 75}, [504] = {50, 51, 148}, [505] = {35, 51, 148},
 [506] = {72, 53, 50}, [507] = {22, 146, 113}, [508] = {22, 146, 113}, [509] = {7, 84, 158}, [510] = {7, 84, 158}, [511] = {82, 65}, [512] = {82, 65}, [513] = {82, 66},
 [514] = {82, 66}, [515] = {82, 67}, [516] = {82, 67}, [517] = {108, 28, 140}, [518] = {108, 28, 140}, [519] = {145, 105, 79}, [520] = {145, 105, 79},
 [521] = {145, 105, 79}, [522] = {31, 78, 157}, [523] = {31, 78, 157}, [524] = {5, 159}, [525] = {5, 159}, [526] = {5, 159}, [527] = {109, 103, 86},
 [528] = {109, 103, 86}, [529] = {146, 159, 104}, [530] = {146, 159, 104}, [531] = {131, 144, 103}, [532] = {62, 125, 89}, [533] = {62, 125, 89}, [534] = {62, 125, 89},
 [535] = {33, 93, 11}, [536] = {33, 93, 11}, [537] = {33, 143, 11}, [538] = {62, 39, 104}, [539] = {5, 39, 104}, [540] = {68, 34, 142}, [541] = {102, 34, 142},
 [542] = {68, 34, 142}, [543] = {38, 68, 95}, [544] = {38, 68, 95}, [545] = {38, 68, 95}, [546] = {158, 151, 34}, [547] = {158, 151, 34}, [548] = {34, 20, 102},
 [549] = {34, 20, 102}, [550] = {120, 91, 104}, [551] = {22, 153, 83}, [552] = {22, 153, 83}, [553] = {22, 153, 83}, [554] = {55, 39}, [555] = {125, 161},
 [556] = {11, 34, 114}, [557] = {5, 75, 133}, [558] = {5, 75, 133}, [559] = {61, 153, 22}, [560] = {61, 153, 22}, [561] = {147, 98, 110}, [562] = {152}, [563] = {152},
 [564] = {116, 5, 33}, [565] = {116, 5, 33}, [566] = {129}, [567] = {129}, [568] = {1, 60, 106}, [569] = {1, 133, 106}, [570] = {149}, [571] = {149},
 [572] = {56, 101, 92}, [573] = {56, 101, 92}, [574] = {119, 23}, [575] = {119, 23}, [576] = {119, 23}, [577] = {142, 98, 144}, [578] = {142, 98, 144},
 [579] = {142, 98, 144}, [580] = {51, 145, 93}, [581] = {51, 145, 93}, [582] = {115, 133}, [583] = {115, 133}, [584] = {115, 133}, [585] = {34, 157, 32},
 [586] = {34, 157, 32}, [587] = {9, 78}, [588] = {68, 61, 99}, [589] = {68, 75, 142}, [590] = {27, 144}, [591] = {27, 144}, [592] = {11, 130, 6}, [593] = {11, 130, 6},
 [594] = {131, 93, 144}, [595] = {14, 127, 68}, [596] = {14, 127, 68}, [597] = {160}, [598] = {160}, [599] = {57, 58, 29}, [600] = {57, 58, 29}, [601] = {57, 58, 29},
 [602] = {26}, [603] = {26}, [604] = {26}, [605] = {140, 28, 148}, [606] = {140, 28, 148}, [607] = {18, 49, 23}, [608] = {18, 49, 23}, [609] = {18, 49, 23},
 [610] = {79, 104, 127}, [611] = {79, 104, 127}, [612] = {79, 104, 127}, [613] = {81, 155}, [614] = {81, 33}, [615] = {26}, [616] = {93, 75, 142}, [617] = {93, 60, 84},
 [618] = {9, 7, 8}, [619] = {39, 144, 120}, [620] = {39, 144, 120}, [621] = {24, 125, 104}, [622] = {89, 103, 99}, [623] = {89, 103, 99}, [624] = {128, 39, 46},
 [625] = {128, 39, 46}, [626] = {120, 157, 43}, [627] = {51, 125, 55}, [628] = {51, 125, 128}, [629] = {145, 142, 133}, [630] = {145, 142, 133}, [631] = {82, 18, 73},
 [632] = {68, 55, 54}, [633] = {55}, [634] = {55}, [635] = {26}, [636] = {49, 68}, [637] = {49, 68}, [638] = {154}, [639] = {154}, [640] = {154}, [641] = {158, 128},
 [642] = {158, 128}, [643] = {163}, [644] = {164}, [645] = {159, 125}, [646] = {46}, [647] = {154}, [648] = {32}, [649] = {88}}

local moveNamesList = {
 -- 第一世代
 "--", "拍击", "空手劈", "连环巴掌", "连续拳", "百万吨重拳", "聚宝功", "火焰拳", "冰冻拳",
 "雷电拳", "抓", "夹住", "断头钳", "旋风刀", "剑舞", "居合斩", "起风", "翅膀攻击",
 "吹飞", "飞翔", "绑紧", "摔打", "藤鞭", "踩踏", "二连踢", "百万吨重踢", "飞踢", "回旋踢",
 "泼沙", "头锤", "角撞", "乱击", "角钻", "撞击", "泰山压顶", "紧束", "猛撞",
 "大闹一番", "舍身冲撞", "摇尾巴", "毒针", "双针", "飞弹针", "瞪眼", "咬住", "叫声", "吼叫",
 "唱歌", "超音波", "音爆", "定身法", "溶解液", "火花", "喷射火焰", "白雾", "水枪", "水炮",
 "冲浪", "冰冻光束", "暴风雪", "幻象光线", "泡沫光线", "极光束", "破坏光线", "啄", "啄钻",
 "地狱翻滚", "踢倒", "双倍奉还", "地球上投", "怪力", "吸取", "超级吸取", "寄生种子", "生长",
 "飞叶快刀", "日光束", "毒粉", "麻痹粉", "催眠粉", "花瓣舞", "吐丝",
 "龙之怒", "火焰旋涡", "电击", "十万伏特", "电磁波", "打雷", "落石", "地震",
 "地裂", "挖洞", "剧毒", "念力", "精神强念", "催眠术", "瑜伽姿势", "高速移动", "电光一闪", "愤怒",
 "瞬间移动", "黑夜魔影", "模仿", "刺耳声", "影子分身", "自我再生", "变硬", "变小", "烟幕",
 "奇异之光", "缩入壳中", "变圆", "屏障", "光墙", "黑雾", "反射壁", "聚气", "忍耐",
 "挥指", "鹦鹉学舌", "自爆", "炸蛋", "舌舔", "浊雾", "污泥攻击", "骨棒", "大字爆炎",
 "攀瀑", "贝壳夹击", "高速星星", "火箭头锤", "尖刺加农炮", "缠绕", "瞬间失忆", "折弯汤匙", "生蛋",
 "飞膝踢", "大蛇瞪眼", "食梦", "毒瓦斯", "投球", "吸血", "恶魔之吻", "神鸟猛击",
 "变身", "泡沫", "迷昏拳", "蘑菇孢子", "闪光", "精神波", "跃起", "溶化", "蟹钳锤",
 "大爆炸", "乱抓", "骨头回力镖", "睡觉", "岩崩", "必杀门牙", "棱角化", "纹理", "三重攻击",
 "愤怒门牙", "劈开", "替身", "挣扎",
 -- 第二世代
 "写生", "三连踢", "小偷", "蛛网", "心之眼",
 "恶梦", "火焰轮", "打鼾", "诅咒", "抓狂", "纹理２", "气旋攻击", "棉孢子", "起死回生",
 "怨恨", "细雪", "守住", "音速拳", "鬼面", "出奇一击", "天使之吻", "腹鼓",
 "污泥炸弹", "掷泥", "章鱼桶炮", "撒菱", "电磁炮", "识破", "同命", "灭亡之歌",
 "冰冻之风", "看穿", "骨棒乱打", "锁定", "逆鳞", "沙暴", "终极吸取", "挺住", "撒娇", "滚动",
 "点到为止", "虚张声势", "喝牛奶", "电光", "连斩", "钢翼", "黑色目光", "迷人", "梦话",
 "治愈铃声", "报恩", "礼物", "迁怒", "神秘守护", "分担痛楚", "神圣之火", "震级",
 "爆裂拳", "超级角击", "龙息", "接棒", "再来一次", "追打", "高速旋转", "甜甜香气",
 "铁尾", "金属爪", "借力摔", "晨光", "光合作用", "月光", "觉醒力量", "十字劈",
 "龙卷风", "求雨", "大晴天", "咬碎", "镜面反射", "自我暗示", "神速", "原始之力",
 "暗影球", "预知未来", "碎岩", "潮旋", "围攻",
 -- 第三世代
 "击掌奇袭", "吵闹", "蓄力", "喷出", "吞下", "热风", "冰雹", "无理取闹", "吹捧", "鬼火",
 "临别礼物", "硬撑", "真气拳", "清醒", "看我嘛", "自然之力", "充电", "挑衅", "帮助",
 "戏法", "扮演", "祈愿", "借助", "扎根", "蛮力", "魔法反射", "回收利用", "报复", "劈瓦",
 "哈欠", "拍落", "蛮干", "喷火", "特性互换", "封印", "焕然一新", "怨念", "抢夺", "秘密之力",
 "潜水", "猛推", "保护色", "萤火", "洁净光芒", "薄霧球", "羽毛舞", "摇晃舞",
 "火焰踢", "玩泥巴", "冰球", "尖刺臂", "偷懒", "巨声", "剧毒牙", "撕裂爪",
 "爆炸烈焰", "加农水炮", "彗星拳", "惊吓", "气象球", "芳香治疗", "假哭", "空气利刃",
 "过热", "气味侦测", "岩石封锁", "银色旋风", "金属音", "草笛", "挠痒", "宇宙力量",
 "喷水", "信号光束", "暗影拳", "神通力", "冲天拳", "流沙地狱", "绝对零度", "浊流",
 "种子机关枪", "燕返", "冰锥", "铁壁", "挡路", "长嚎", "龙爪", "疯狂植物", "健美",
 "弹跳", "泥巴射击", "毒尾", "渴望", "伏特攻击", "魔法叶", "玩水", "冥想", "叶刃",
 "龙之舞", "岩石爆击", "电击波", "水之波动", "破灭之愿", "精神突进",
 -- 第四世代
 "羽栖", "重力", "奇迹之眼", "唤醒巴掌", "臂錘", "陀螺球", "治愈之愿", "盐水", "自然之恩",
 "佯攻", "啄食", "顺风", "点穴", "金属爆炸", "急速折返", "近身战", "以牙還牙", "恶意追击", "查封",
 "投擲", "精神转移", "王牌", "回复封锁", "绞紧", "力量戏法", "胃液", "幸运咒语", "抢先一步",
 "仿效", "力量互换", "防守互换", "懲罰", "珍藏", "烦恼种子", "突袭", "毒菱",
 "心灵互换", "水流环", "电磁飘浮", "闪焰冲锋", "发劲", "波导弹", "岩石打磨", "毒击",
 "恶之波动", "暗袭要害", "水流尾", "种子炸弹", "空气斩", "十字剪", "虫鸣", "龙之波动", "龙之俯冲",
 "力量宝石", "吸取拳", "真空波", "真气弹", "能量球", "勇鸟猛攻", "大地之力", "掉包",
 "终极冲击", "诡计", "子弹拳", "雪崩", "冰砾", "暗影爪", "雷电牙", "冰冻牙",
 "火焰牙", "影子偷袭", "泥巴炸弹", "精神利刃", "意念头锤", "镜光射击", "加农光炮", "攀岩",
 "清除浓雾", "戏法空间", "流星群", "放电", "喷烟", "飞叶风暴", "强力鞭打", "岩石炮",
 "十字毒刃", "垃圾射击", "铁头", "磁铁炸弹", "尖石攻击", "诱惑", "隐形岩", "打草结", "喋喋不休",
 "制裁光砾", "虫咬", "充电光束", "木槌", "水流喷射", "攻击指令", "防御指令", "回复指令", "双刃头锤",
 "二连击", "时光咆哮", "亚空裂斩", "新月舞", "捏碎", "熔岩风暴", "暗黑洞", "种子闪光",
 "奇异之风", "暗影潜袭",
 -- 第五世代
 "磨爪", "广域防守", "防守平分", "力量平分", "奇妙空间", "精神衝擊", "毒液衝擊", "身体轻量化", "憤怒粉",
 "意念移物", "魔法空间", "击落", "山岚摔", "烈焰溅射", "污泥波", "蝶舞", "重磅冲撞",
 "同步干擾", "电球", "浸水", "蓄能焰襲", "盤蜷", "下盘踢", "酸液炸弹", "欺诈", "单纯光束",
 "找伙伴", "您先請", "轮唱", "迴声", "逐步击破", "清除之煙", "辅助力量", "快速防守", "交换场地",
 "热水", "破壳", "治愈波动", "祸不单行", "自由落体", "换档", "巴投", "烧尽", "延後", "杂技",
 "镜面属性", "報仇", "搏命", "传递礼物", "炼狱", "水之誓约", "火之誓約", "草之誓约",
 "伏特替换", "虫之抵抗", "重踏", "冰息", "龙尾", "自我激励", "电网", "瘋狂伏特",
 "直冲钻", "二连劈", "愛心印章", "木角", "圣剑", "贝壳刃", "高溫重压", "青草搅拌器",
 "疯狂滚压", "棉花防守", "暗黑爆破", "精神击破", "扫尾拍打", "暴风", "爆炸头突击", "齿轮飞盘",
 "火焰弹", "高科技光炮", "古老之歌", "神秘之剑", "冰封世界", "雷击", "青焰", "火之舞",
 "冰冻伏特", "极寒冷焰", "大声咆哮", "冰柱坠击", "Ｖ熱焰", "交错火焰", "交错闪电"}

local itemNamesList = {
 "无", "大师球", "高级球", "超级球", "精灵球", "狩猎球", "捕网球", "潜水球",
 "巢穴球", "重复球", "计时球", "豪华球", "纪念球", "黑暗球", "治愈球", "先机球",
 "贵重球", "伤药", "解毒药", "灼伤药", "解冻药", "解眠药", "解麻药", "全复药",
 "全满药", "厉害伤药", "好伤药", "万灵药", "活力碎片", "活力块", "美味之水", "劲爽汽水",
 "果汁牛奶", "哞哞鲜奶", "元气粉", "元气根", "万能粉", "复活草", "ＰＰ单项小补剂", "ＰＰ单项全补剂", "ＰＰ多项小补剂",
 "ＰＰ多项全补剂", "釜炎仙贝", "树果汁", "圣灰", "ＨＰ增强剂", "攻击增强剂", "防御增强剂", "速度增强剂", "特攻增强剂", "神奇糖果",
 "ＰＰ提升剂", "特防增强剂", "ＰＰ极限提升剂", "森之羊羹", "能力防守", "要害攻击", "力量强化", "防御强化", "速度强化", "命中强化", "特攻强化",
 "特防强化", "皮皮玩偶", "向尾喵的尾巴", "蓝色玻璃哨", "黄色玻璃哨", "红色玻璃哨", "黑色玻璃哨", "白色玻璃哨", "浅滩海盐",
 "浅滩贝壳", "红色碎片", "蓝色碎片", "黄色碎片", "绿色碎片", "白银喷雾", "黄金喷雾", "离洞绳", "除虫喷雾",
 "日之石", "月之石", "火之石", "雷之石", "水之石", "叶之石", "小蘑菇", "大蘑菇", "珍珠",
 "大珍珠", "星星沙子", "星星碎片", "金珠", "心之鳞片", "甜甜蜜", "速速肥", "湿湿肥", "久久肥",
 "粘粘肥", "根状化石", "爪子化石", "贝壳化石", "甲壳化石", "秘密琥珀", "盾甲化石", "头盖化石",
 "贵重骨头", "光之石", "暗之石", "觉醒之石", "浑圆之石", "楔石", "白金宝珠", "未知", "未知",
 "未知", "水流卡带", "闪电卡带", "火焰卡带", "冰冻卡带", "未知", "未知", "未知", "未知", "未知",
 "未知", "未知", "未知", "未知", "未知", "未知", "未知", "未知", "未知", "心形甜点", "金刚宝珠",
 "白玉宝珠", "初次邮件", "喜爱邮件", "邀请邮件", "感谢邮件", "询问邮件", "推荐邮件", "回复邮件",
 "桥梁邮件Ｓ", "桥梁邮件Ｈ", "桥梁邮件Ｃ", "桥梁邮件Ｖ", "桥梁邮件Ｗ", "樱子果", "零余果", "桃桃果",
 "莓莓果", "利木果", "苹野果", "橙橙果", "柿仔果", "木子果", "文柚果", "勿花果", "异奇果",
 "芒芒果", "乐芭果", "芭亚果", "蔓莓果", "墨莓果", "蕉香果", "西梨果", "凰梨果", "榴石果",
 "藻根果","比巴果", "哈密果", "萄葡果", "茄番果", "玉黍果", "岳竹果", "茸丹果",
 "檬柠果", "刺角果", "椰木果", "瓜西果", "金枕果", "靛莓果", "巧可果", "千香果",
 "烛木果", "罗子果", "番荔果", "莲蒲果", "通通果", "腰木果", "棱瓜果", "福禄果", "扁樱果",
 "草蚕果", "佛柑果", "莓榴果", "刺耳果", "霹霹果", "灯浆果", "枝荔果", "龙睛果",
 "沙鳞果", "龙火果", "杏仔果", "兰萨果", "星桃果", "谜芝果", "奇秘果", "释陀果",
 "嘉珍果", "雾莲果", "光粉", "白色香草", "强制锻炼器", "学习装置", "先制之爪", "安抚之铃", "心灵香草",
 "讲究头带", "王者之证", "银粉", "护符金币", "洁净之符", "心之水滴", "深海之牙", "深海鳞片", "烟雾球",
 "不变之石", "气势头带", "幸运蛋", "焦点镜", "金属膜", "吃剩的东西", "龙之鳞片", "电气球", "柔软沙子", "硬石头",
 "奇迹种子", "黑色眼镜", "黑带", "磁铁", "神秘水滴", "锐利鸟嘴", "毒针", "不融冰", "诅咒之符",
 "弯曲的汤匙", "木炭", "龙之牙", "丝绸围巾", "升级数据", "贝壳之铃", "海潮薰香", "悠闲薰香", "吉利拳",
 "金属粉", "粗骨头", "大葱", "红色头巾", "蓝色头巾", "粉红头巾", "绿色头巾", "黄色头巾", "广角镜",
 "力量头带", "博识眼镜", "达人带", "光之黏土", "生命宝珠", "强力香草", "剧毒宝珠", "火焰宝珠", "速度粉",
 "气势披带", "对焦镜", "节拍器", "黑色铁球", "后攻之尾", "红线", "黑色污泥", "冰冷岩石", "沙沙岩石",
 "炽热岩石", "潮湿岩石", "紧缠钩爪", "讲究围巾", "附着针", "力量护腕", "力量腰带", "力量镜", "力量束带",
 "力量护踝", "力量负重", "美丽空壳", "大根茎", "讲究眼镜", "火球石板", "水滴石板", "雷电石板", "碧绿石板",
 "冰柱石板", "拳头石板", "剧毒石板", "大地石板", "蓝天石板", "神奇石板", "玉虫石板", "岩石石板", "妖怪石板",
 "龙之石板", "恶颜石板", "钢铁石板", "奇异薰香", "岩石薰香", "饱腹薰香", "涟漪薰香", "花朵薰香",
 "幸运薰香", "洁净薰香", "护具", "电力增幅器", "熔岩增幅器", "可疑补丁", "灵界之布", "锐利之爪", "锐利之牙",
 "招式学习器01", "招式学习器02", "招式学习器03", "招式学习器04", "招式学习器05", "招式学习器06", "招式学习器07", "招式学习器08", "招式学习器09", "招式学习器10", "招式学习器11", "招式学习器12", "招式学习器13", "招式学习器14", "招式学习器15", "招式学习器16", "招式学习器17",
 "招式学习器18", "招式学习器19", "招式学习器20", "招式学习器21", "招式学习器22", "招式学习器23", "招式学习器24", "招式学习器25", "招式学习器26", "招式学习器27", "招式学习器28", "招式学习器29", "招式学习器30", "招式学习器31", "招式学习器32", "招式学习器33", "招式学习器34",
 "招式学习器35", "招式学习器36", "招式学习器37", "招式学习器38", "招式学习器39", "招式学习器40", "招式学习器41", "招式学习器42", "招式学习器43", "招式学习器44", "招式学习器45", "招式学习器46", "招式学习器47", "招式学习器48", "招式学习器49", "招式学习器50", "招式学习器51",
 "招式学习器52", "招式学习器53", "招式学习器54", "招式学习器55", "招式学习器56", "招式学习器57", "招式学习器58", "招式学习器59", "招式学习器60", "招式学习器61", "招式学习器62", "招式学习器63", "招式学习器64", "招式学习器65", "招式学习器66", "招式学习器67", "招式学习器68",
 "招式学习器69", "招式学习器70", "招式学习器71", "招式学习器72", "招式学习器73", "招式学习器74", "招式学习器75", "招式学习器76", "招式学习器77", "招式学习器78", "招式学习器79", "招式学习器80", "招式学习器81", "招式学习器82", "招式学习器83", "招式学习器84", "招式学习器85",
 "招式学习器86", "招式学习器87", "招式学习器88", "招式学习器89", "招式学习器90", "招式学习器91", "招式学习器92", "秘传学习器01", "秘传学习器02", "秘传学习器03", "秘传学习器04", "秘传学习器05", "秘传学习器06", "未知", "未知",
 "探险套装", "宝物袋", "规则书", "宝可追踪", "点数卡", "冒险笔记", "贴纸盒", "饰品盒", "贴纸袋", "朋友手册",
 "发电厂钥匙", "古代护符", "银河队钥匙", "红色锁链", "城镇地图", "对战搜寻器", "代币盒", "破旧钓竿", "好钓竿", "厉害钓竿",
 "可达鸭喷壶", "宝芬盒", "自行车", "房间钥匙", "大木的信", "新月之羽", "会员卡", "天界之笛", "船票",
 "华丽大赛参加证", "火山镇石", "包裹", "兑换券１", "兑换券２", "兑换券３", "仓库钥匙", "秘传之药", "对战记录器", "葛拉西蒂亚花",
 "秘密钥匙", "球果盒", "未知图腾笔记", "树果种植盆", "探宝器", "蓝卡", "美味尾巴", "透明铃铛", "钥匙卡",
 "地下钥匙", "杰尼龟喷壶", "红色鳞片", "遗失物", "定期月票", "机械零件", "银色之羽", "虹色之羽", "神奇蛋",
 "红球果", "黄球果", "蓝球果", "绿球果", "粉球果", "白球果", "黑球果", "速度球", "等级球",
 "诱饵球", "沉重球", "甜蜜球", "友友球", "月亮球", "竞赛球", "公园球", "相册", "ＧＢ播放器", "海声铃铛",
 "愤怒馒头", "数据卡01", "数据卡02", "数据卡03", "数据卡04", "数据卡05", "数据卡06", "数据卡07",
 "数据卡08", "数据卡09", "数据卡10", "数据卡11", "数据卡12", "数据卡13", "数据卡14", "数据卡15",
 "数据卡16", "数据卡17", "数据卡18", "数据卡19", "数据卡20", "数据卡21", "数据卡22", "数据卡23",
 "数据卡24", "数据卡25", "数据卡26", "数据卡27", "草绿色宝珠", "上锁的容器", "朱红色宝珠", "靛蓝色宝珠", "谜之水晶",
 "美丽鳞片", "进化奇石", "轻石", "凸凸头盔", "气球", "红牌", "标靶", "紧绑束带", "球根",
 "充电电池", "逃脱按键", "火之宝石", "水之宝石", "电之宝石", "草之宝石", "冰之宝石", "格斗宝石", "毒之宝石",
 "地面宝石", "飞行宝石", "超能力宝石", "虫之宝石", "岩石宝石", "幽灵宝石", "龙之宝石", "恶之宝石", "钢之宝石", "一般宝石",
 "体力之羽", "肌力之羽", "抵抗之羽", "智力之羽", "精神之羽", "瞬发之羽", "美丽之羽", "背盖化石", "羽毛化石",
 "自由船票", "释出之玉", "梦境球", "宝可尾草", "物品箱", "龙之骨", "芳香蘑菇", "巨大金珠", "丸子珍珠",
 "彗星碎片", "古代铜币", "古代银币", "古代金币", "古代之壶", "古代手镯", "古代石像", "古代王冠", "飞云冰淇淋",
 "要害攻击2", "速度强化2", "特攻强化2", "特防强化2", "防御强化2", "力量强化2", "命中强化2", "速度强化3", "特攻强化3",
 "特防强化3", "防御强化3", "力量强化3", "命中强化3", "速度强化6", "特攻强化6", "特防强化6", "防御强化6", "力量强化6",
 "命中强化6", "特性催促", "道具掉落", "道具催促", "重置催促", "要害攻击3", "光明石", "黑暗石", "招式学习器93", "招式学习器94",
 "招式学习器95", "即时通讯器", "神石", "配送物品１", "配送物品２", "配送物品３", "即时通讯器", "奖牌盒", "基因之楔", "基因之楔", "许可证",
 "圆形护符", "闪耀护符", "等离子卡", "脏手帕", "阿克罗玛机器", "遗忘物", "遗忘物", "现形镜"}

local locationNamesList = {"黑色市", "黑色市", "黑色市", "黑色市", "黑色市", "黑色市", "三曜市", "三曜市", "三曜市",
 "三曜市", "三曜市", "三曜市", "三曜市", "三曜市", "三曜市", "三曜市", "七宝市", "七宝市", "七宝市",
 "七宝市", "七宝市", "七宝市", "七宝市", "七宝市", "七宝市", "七宝市", "七宝市", "七宝闸口", "飞云市",
 "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市",
 "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市",
 "飞云市", "飞云市", "飞云闸口", "皇家合众号", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市", "飞云市",
 "飞云市", "飞云市", "飞云市", "雷文市", "雷文市", "雷文市", "雷文市", "齿轮站", "齿轮站", "齿轮站",
 "齿轮站", "齿轮站", "齿轮站", "齿轮站", "齿轮站", "齿轮站", "對戰地下鐵", "對戰地下鐵", "音乐剧剧场", "音乐剧剧场",
 "雷文市", "雷文市", "雷文市", "雷文市", "雷文市", "雷文市", "雷文市", "雷文市", "雷文市", "雷文市",
 "雷文市", "雷文闸口", "雷文闸口", "雷文闸口", "雷文市", "雷文市", "雷文市", "帆巴市", "帆巴市", "帆巴市",
 "帆巴市", "帆巴市", "帆巴市", "帆巴市", "帆巴市", "帆巴市", "帆巴市", "帆巴市", "吹寄市",
 "吹寄市", "吹寄市", "吹寄市", "吹寄市", "吹寄市", "雪花市", "雪花市", "雪花市", "雪花市",
 "雪花市", "雪花市", "雪花市", "双龙市", "双龙市", "双龙市", "双龙市", "双龙市", "双龙市", "双龙市",
 "双龙市", "双龙市", "双龙市", "双龙市", "双龙闸口", "双龙闸口", "双龙闸口", "双龙市", "双龙市", "宝可梦联盟",
 "宝可梦联盟", "宝可梦联盟", "宝可梦联盟", "宝可梦联盟", "宝可梦联盟", "宝可梦联盟", "宝可梦联盟", "宝可梦联盟", "宝可梦联盟",
 "宝可梦联盟", "聯合塔", "聯合塔", "聯合塔", "－－－－－－－－－－", "－－－－－－－－－－", "梦的遺址", "梦的遺址", "矢車森林", "矢車森林",
 "思索原野", "荒野名勝區", "荒野名勝區", "道路闸口", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城",
 "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城",
 "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城", "古代城",
 "古代城", "古代城", "古代城", "冷凍倉庫", "冷凍倉庫", "冷凍倉庫", "電氣石洞穴", "電氣石洞穴", "電氣石洞穴", "電氣石洞穴",
 "罗斯山", "罗斯山", "罗斯山", "罗斯山", "罗斯山", "罗斯山", "罗斯山", "龍螺旋之塔", "龍螺旋之塔",
 "龍螺旋之塔", "龍螺旋之塔", "龍螺旋之塔", "龍螺旋之塔", "龍螺旋之塔", "龍螺旋之塔", "龍螺旋之塔", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）",
 "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）",
 "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "冠軍之路（黑／白） 冠軍之路（黑２／白２）", "试炼之间", "巨人洞窟", "巨人洞窟", "巨人洞窟", "巨人洞窟", "巨人洞窟", "自由庭園島", "自由庭園島", "自由庭園島",
 "Ｐ２實驗室", "Ｐ２實驗室", "漣漪灣", "海底遺跡", "海底遺跡", "海底遺跡", "海底遺跡", "海底遺跡", "海底遺跡", "海底遺跡", "海底遺跡",
 "天箭橋", "桥梁闸口", "桥梁闸口", "桥梁闸口", "帆巴吊橋", "圓筒橋", "村莊橋", "村莊橋", "村莊橋", "村莊橋",
 "村莊橋", "村莊橋", "村莊橋", "村莊橋", "奇幻橋", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡",
 "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "Ｎ的城堡", "連入", "连入之森", "连入之森",
 "连入之森", "连入之森", "连入之森", "连入之森", "连入之森", "连入之森", "连入之森", "雷文市", "帆巴市", "吹寄市",
 "雪花市", "双龙市", "黑色市", "白森林", "冷凍倉庫", "電氣石洞穴", "罗斯山", "龍螺旋之塔", "巨人洞窟", "帆巴吊橋",
 "圓筒橋", "奇幻橋", "5号道路", "6号道路", "7号道路", "8号道路", "9号道路", "11号道路", "12号道路", "13号道路", "14号道路", "15号道路", "16号道路", "笼目镇",
 "涟漪镇", "1号道路", "道路闸口", "2号道路", "唐草闸口", "3号道路", "3号道路", "3号道路", "泉源洞穴", "泉源洞穴", "4号道路", "4号道路", "4号道路", "5号道路",
 "5号道路", "6号道路", "6号道路", "吹寄洞穴", "吹寄洞穴", "引导之间", "6号道路", "7号道路", "天堂之塔", "天堂之塔", "天堂之塔",
 "天堂之塔", "天堂之塔", "7号道路", "7号道路", "8号道路", "雪花濕地", "桥梁闸口", "9号道路", "桥梁闸口", "购物中心", "购物中心", "修行岩屋",
 "修行岩屋", "修行岩屋", "10号道路", "10号道路", "10号道路", "10号道路", "10号道路", "10号道路", "10号道路", "10号道路", "10号道路", "10号道路", "11号道路",
 "桥梁闸口", "11号道路", "12号道路", "桥梁闸口", "13号道路", "13号道路", "涟漪闸口", "13号道路", "14号道路", "黑色闸口", "豐饒之祠", "豐饒之祠", "15号道路",
 "黑色闸口", "桥梁闸口", "傳送工廠", "15号道路", "16号道路", "桥梁闸口", "迷幻森林", "迷幻森林", "18号道路", "18号道路", "鹿子镇", "鹿子镇",
 "鹿子镇", "鹿子镇", "鹿子镇", "鹿子镇", "鹿子镇", "鹿子镇", "唐草镇", "唐草镇", "唐草镇", "唐草镇", "唐草镇",
 "唐草镇", "唐草镇", "唐草镇", "唐草镇", "笼目镇", "笼目镇", "笼目镇", "笼目镇", "笼目镇", "笼目镇", "涟漪镇",
 "涟漪镇", "涟漪镇", "涟漪镇", "涟漪镇", "涟漪镇", "金轮镇", "金轮镇", "金轮镇", "金轮镇", "－－－－－－－－－－", "17号道路",
 "白森林", "白森林", "白森林"}

local statusConditionNamesList = {"无", "麻痹", "睡眠", "冰冻", "灼伤", "中毒"}

emu.reset()

local gameCode = read32Bit(0x2FFFE0C)
local gameVersionCode = band(rshift(gameCode, 16), 0xFF)
local gameVersion = ""
local gameLanguageCode = rshift(gameCode, 24)
local gameLanguage = ""
local wrongGameVersion = true

if gameVersionCode == 0x41 then  -- 检查游戏版本
 gameVersion = "白"
elseif gameVersionCode == 0x42 then
 gameVersion = "黑"
elseif gameVersionCode == 0x44 then
 gameVersion = "白２"
elseif gameVersionCode == 0x45 then
 gameVersion = "黑２"
end

function getGameAddrOffset(version, offset)
 return gameVersion == version and offset or 0
end

local mtSeedAddr, mtIndexAddr, currentSeedAddr, boxAddr, partySlotsCounterAddr, partyAddr, trainerIDsAddr, roamerAddr, playerMapIndexAddr, cgearEnemyAddr,
      currBoxIndexAddr, partySelectedSlotIndexAddr, partyStatsSelectedSlotIndexAddr, enemyAddr, pokemonBoxStatsAddr, boxSelectedSlotIndexAddr

if gameLanguageCode == 0x44 then  -- 检查游戏语言并设置地址
 gameLanguage = "GER"
 mtSeedAddr = 0x2215294 + getGameAddrOffset("白", 0x20)
 mtIndexAddr = 0x2215C54 + getGameAddrOffset("白", 0x20)
 currentSeedAddr = 0x2216164 + getGameAddrOffset("白", 0x20)
 boxAddr = 0x221BEEC + getGameAddrOffset("白", 0x20)
 partySlotsCounterAddr = 0x22348F0 + getGameAddrOffset("白", 0x20)
 partyAddr = 0x22348F4 + getGameAddrOffset("白", 0x20)
 trainerIDsAddr = 0x2234F00 + getGameAddrOffset("白", 0x20)
 roamerAddr = 0x223D604 + getGameAddrOffset("白", 0xC)
 playerMapIndexAddr = 0x224F84C + getGameAddrOffset("白", 0x20)
 cgearEnemyAddr = 0x225CE50 + getGameAddrOffset("白", 0x20)
 currBoxIndexAddr = 0x22696C0 + getGameAddrOffset("白", 0x20)
 partyStatsSelectedSlotIndexAddr = 0x22696C4 + getGameAddrOffset("白", 0x20)
 partySelectedSlotIndexAddr = 0x22696D8 + getGameAddrOffset("白", 0x20)
 enemyAddr = 0x226AC34 + getGameAddrOffset("白", 0x20)
 pokemonBoxStatsAddr = 0x227994C + getGameAddrOffset("白", 0x20)
 boxSelectedSlotIndexAddr = 0x22EB81D + getGameAddrOffset("白", 0x20)
elseif gameLanguageCode == 0x46 then
 gameLanguage = "FRE"
 mtSeedAddr = 0x22152D4 + getGameAddrOffset("白", 0x20)
 mtIndexAddr = 0x2215C94 + getGameAddrOffset("白", 0x20)
 currentSeedAddr = 0x22161A4 + getGameAddrOffset("白", 0x20)
 boxAddr = 0x221BF2C + getGameAddrOffset("白", 0x20)
 partySlotsCounterAddr = 0x2234930 + getGameAddrOffset("白", 0x20)
 partyAddr = 0x2234934 + getGameAddrOffset("白", 0x20)
 trainerIDsAddr = 0x2234F40 + getGameAddrOffset("白", 0x20)
 roamerAddr = 0x223D644 + getGameAddrOffset("白", 0xC)
 playerMapIndexAddr = 0x224F88C + getGameAddrOffset("白", 0x20)
 cgearEnemyAddr = 0x225CE90 + getGameAddrOffset("白", 0x20)
 currBoxIndexAddr = 0x2269700 + getGameAddrOffset("白", 0x20)
 partyStatsSelectedSlotIndexAddr = 0x2269704 + getGameAddrOffset("白", 0x20)
 partySelectedSlotIndexAddr = 0x2269718 + getGameAddrOffset("白", 0x20)
 enemyAddr = 0x226AC74 + getGameAddrOffset("白", 0x20)
 pokemonBoxStatsAddr = 0x227998C + getGameAddrOffset("白", 0x20)
 boxSelectedSlotIndexAddr = 0x22EB85D + getGameAddrOffset("白", 0x20)
elseif gameLanguageCode == 0x49 then
 gameLanguage = "ITA"
 mtSeedAddr = 0x2215254 + getGameAddrOffset("白", 0x20)
 mtIndexAddr = 0x2215C14 + getGameAddrOffset("白", 0x20)
 currentSeedAddr = 0x2216124 + getGameAddrOffset("白", 0x20)
 boxAddr = 0x221BEAC + getGameAddrOffset("白", 0x20)
 partySlotsCounterAddr = 0x22348B0 + getGameAddrOffset("白", 0x20)
 partyAddr = 0x22348B4 + getGameAddrOffset("白", 0x20)
 trainerIDsAddr = 0x2234EC0 + getGameAddrOffset("白", 0x20)
 roamerAddr = 0x223D5C4 + getGameAddrOffset("白", 0xC)
 playerMapIndexAddr = 0x224F80C + getGameAddrOffset("白", 0x20)
 cgearEnemyAddr = 0x225CE10 + getGameAddrOffset("白", 0x20)
 currBoxIndexAddr = 0x2269680 + getGameAddrOffset("白", 0x20)
 partyStatsSelectedSlotIndexAddr = 0x2269684 + getGameAddrOffset("白", 0x20)
 partySelectedSlotIndexAddr = 0x2269698 + getGameAddrOffset("白", 0x20)
 enemyAddr = 0x226ABF4 + getGameAddrOffset("白", 0x20)
 pokemonBoxStatsAddr = 0x227990C + getGameAddrOffset("白", 0x20)
 boxSelectedSlotIndexAddr = 0x22EB7DD + getGameAddrOffset("白", 0x20)
elseif gameLanguageCode == 0x4A then
 gameLanguage = "JPN"
 mtSeedAddr = 0x22151B4 + getGameAddrOffset("白", 0x20)
 mtIndexAddr = 0x2215B74 + getGameAddrOffset("白", 0x20)
 currentSeedAddr = 0x2216084 + getGameAddrOffset("白", 0x20)
 boxAddr = 0x221BE0C + getGameAddrOffset("白", 0x20)
 partySlotsCounterAddr = 0x2234810 + getGameAddrOffset("白", 0x20)
 partyAddr = 0x2234814 + getGameAddrOffset("白", 0x20)
 trainerIDsAddr = 0x2234E20 + getGameAddrOffset("白", 0x20)
 roamerAddr = 0x223D524 + getGameAddrOffset("白", 0xC)
 playerMapIndexAddr = 0x224F76C + getGameAddrOffset("白", 0x20)
 cgearEnemyAddr = 0x225CC84 + getGameAddrOffset("白", 0x20)
 currBoxIndexAddr = 0x22695E0 + getGameAddrOffset("白", 0x20)
 partyStatsSelectedSlotIndexAddr = 0x22695E4 + getGameAddrOffset("白", 0x20)
 partySelectedSlotIndexAddr = 0x22695F8 + getGameAddrOffset("白", 0x20)
 enemyAddr = 0x226AB54 + getGameAddrOffset("白", 0x20)
 pokemonBoxStatsAddr = 0x227986C + getGameAddrOffset("白", 0x20)
 boxSelectedSlotIndexAddr = 0x22EB745 + getGameAddrOffset("白", 0x20)
elseif gameLanguageCode == 0x4B then
 gameLanguage = "KOR"
 mtSeedAddr = 0x2215A54
 mtIndexAddr = 0x2216414
 currentSeedAddr = 0x2216924
 boxAddr = 0x221C6AC
 partySlotsCounterAddr = 0x22350B0
 partyAddr = 0x22350B4
 trainerIDsAddr = 0x22356C0
 roamerAddr = 0x223DDB0 + getGameAddrOffset("黑", 0x14)
 playerMapIndexAddr = 0x225000C
 cgearEnemyAddr = 0x225D610
 currBoxIndexAddr = 0x2269E80
 partyStatsSelectedSlotIndexAddr = 0x2269E84
 partySelectedSlotIndexAddr = 0x2269E98
 enemyAddr = 0x226B3F4
 pokemonBoxStatsAddr = 0x227A10C
 boxSelectedSlotIndexAddr = 0x22EBFE1
elseif gameLanguageCode == 0x4F then
 gameLanguage = "USA"
 mtSeedAddr = 0x2215354 + getGameAddrOffset("白", 0x20)
 mtIndexAddr = 0x2215D14 + getGameAddrOffset("白", 0x20)
 currentSeedAddr = 0x2216224 + getGameAddrOffset("白", 0x20)
 boxAddr = 0x221BFAC + getGameAddrOffset("白", 0x20)
 partySlotsCounterAddr = 0x22349B0 + getGameAddrOffset("白", 0x20)
 partyAddr = 0x22349B4 + getGameAddrOffset("白", 0x20)
 trainerIDsAddr = 0x2234FC0 + getGameAddrOffset("白", 0x20)
 roamerAddr = 0x223D6C4 + getGameAddrOffset("白", 0xC)
 playerMapIndexAddr = 0x224F90C + getGameAddrOffset("白", 0x20)
 cgearEnemyAddr = 0x225CF10 + getGameAddrOffset("白", 0x20)
 currBoxIndexAddr = 0x2269780 + getGameAddrOffset("白", 0x20)
 partyStatsSelectedSlotIndexAddr = 0x2269784 + getGameAddrOffset("白", 0x20)
 partySelectedSlotIndexAddr = 0x2269798 + getGameAddrOffset("白", 0x20)
 enemyAddr = 0x226ACF4 + getGameAddrOffset("白", 0x20)
 pokemonBoxStatsAddr = 0x2279A0C + getGameAddrOffset("白", 0x20)
 boxSelectedSlotIndexAddr = 0x22EB8E1 + getGameAddrOffset("白", 0x20)
elseif gameLanguageCode == 0x53 then
 gameLanguage = "SPA"
 mtSeedAddr = 0x2215314
 mtIndexAddr = 0x2215CD4
 currentSeedAddr = 0x22161E4
 boxAddr = 0x221BF6C
 partySlotsCounterAddr = 0x2234970
 partyAddr = 0x2234974
 trainerIDsAddr = 0x2234F80
 roamerAddr = 0x223D670 + getGameAddrOffset("黑", 0x14)
 playerMapIndexAddr = 0x224F8CC
 cgearEnemyAddr = 0x225CED0
 currBoxIndexAddr = 0x2269740
 partyStatsSelectedSlotIndexAddr = 0x2269744
 partySelectedSlotIndexAddr = 0x2269758
 enemyAddr = 0x226ACB4
 pokemonBoxStatsAddr = 0x22799CC
 boxSelectedSlotIndexAddr = 0x22EB8A1
end

function printGameInfo()
 if gameVersion == "" then  -- 打印游戏信息
  print("版本：未知游戏")
 elseif gameVersion ~= "黑" and gameVersion ~= "白" then
  print(string.format("版本：%s - 游戏版本错误！请改用黑／白\n", gameVersion))
 elseif gameLanguage == "" then
  print("版本："..gameVersion)
  print("语言：未知语言\n")
 else
  wrongGameVersion = false
  print("版本："..gameVersion)
  print(string.format("语言：%s\n", gameLanguage))
 end
end

printGameInfo()

local mode, index = {"无", "捕获", "培育", "游走宝可梦", "C-Gear", "潘多拉", "宝可梦信息"}, 1

function setBackgroundBoxes()  -- 设置透明黑色框
 if mode[index] == "捕获" or mode[index] == "培育" or mode[index] == "C-Gear" or mode[index] == "宝可梦信息" then
  gui.box(1, -191, 156, -59, "#0000007F", "#0000007F")
 elseif mode[index] == "游走宝可梦" then
  gui.box(1, -191, 156, -70, "#0000007F", "#0000007F")
 end

 gui.box(1, 55, 164, 66, "#0000007F", "#0000007F")

 if mode[index] ~= "无" then
  gui.box(151, 180, 254, 190, "#0000007F", "#0000007F")
  gui.box(193, -24, 254, -2, "#0000007F", "#0000007F")
 end
end

local dateTime = {["月"] = 1, ["日"] = 1, ["年"] = 0, ["小时"] = 0, ["分钟"] = 0, ["秒"] = 0}

function setDateTime()
 local dateTimeAddr = 0x23FFDE8

 dateTime["年"] = string.format("%02X", read8Bit(dateTimeAddr))
 dateTime["月"] = string.format("%02X", read8Bit(dateTimeAddr + 0x1))
 dateTime["日"] = string.format("%02X", read8Bit(dateTimeAddr + 0x2))
 dateTime["小时"] = string.format("%02X", read8Bit(dateTimeAddr + 0x4) % 0x40)
 dateTime["分钟"] = string.format("%02X", read8Bit(dateTimeAddr + 0x5))
 dateTime["秒"] = string.format("%02X", read8Bit(dateTimeAddr + 0x6))
end

function drawArrowLeft(a, b, c)
 gui.line(a, b + 3, a + 2, b + 5, c)
 gui.line(a, b + 3, a + 2, b + 1, c)
 gui.line(a, b + 3, a + 6, b + 3, c)
end

function drawArrowRight(a, b, c)
 gui.line(a, b + 3, a - 2, b + 5, c)
 gui.line(a, b + 3, a - 2, b + 1, c)
 gui.line(a, b + 3, a - 6, b + 3, c)
end

local prevKey = {}

function getTabInput()
 local leftArrowColor = "gray"
 local rightArrowColor = "gray"
 local key = input.get()

 if (key["1"] or key["numpad1"]) and (not prevKey["1"] and not prevKey["numpad1"]) then
  leftArrowColor = "orange"
  index = index - 1 < 1 and 7 or index - 1
 elseif (key["2"] or key["numpad2"]) and (not prevKey["2"] and not prevKey["numpad2"]) then
  rightArrowColor = "orange"
  index = index + 1 > 7 and 1 or index + 1
 end

 prevKey = key
 gui.text(2, 57, "模式："..mode[index])
 drawArrowLeft(113, 57, leftArrowColor)
 gui.text(121, 57, "1 - 2")
 drawArrowRight(159, 57, rightArrowColor)
end

local initialSeedFlag, prevMTSeed, initialSeedHigh, initialSeedLow, tempCurrentSeedLow, mtCounter = false, 0, 0, 0, 0, 0

function checkInitialSeedGeneration(mtSeed, currentHigh, currentLow, delay)
 if currentLow ~= 0 and not initialSeedFlag then  -- 当 RAM 中 LCRNG 当前种子地址初始化时设置初始种子
  initialSeedFlag = true
  prevMTSeed = mtSeed
  initialSeedHigh = currentHigh
  initialSeedLow = currentLow
  tempCurrentSeedLow = currentLow
  print(string.format("初始种子：%08X%08X", initialSeedHigh, initialSeedLow))
 elseif delay == 0 then
   initialSeedFlag = false
   prevMTSeed = 0
   initialSeedHigh = 0
   initialSeedLow = 0
   tempCurrentSeedLow = 0
   mtCounter = 0
   cgearSeed = 0
   hitDelay = 0
   hitDate = "2000/01/01\n00:00:00"
 end
end

local UPPER_MASK = 0x80000000

function tobit(value)
 return (value % 0x100000000) - (value >= UPPER_MASK and 0x100000000 or 0)
end

local N = 624

function initializeMTArray(seed)
 local mt = {}
 mt[1] = seed

 for i = 1, N - 1 do
  seed = bxor(seed, rshift(seed, 30))
  local seedLow = band(seed, 0xFFFF)
  local seedHigh = rshift(seed, 16)
  local seedLow2 = band((0x6C078965 * seedLow), 0xFFFFFFFF)
  local seedHigh2 = band((0x6C078965 * seedHigh), 0xFFFF)
  seed = band(bor(lshift((rshift(seedLow2, 16) + seedHigh2), 16), band(seedLow2, 0xFFFF)), 0xFFFFFFFF)
  local seedLim = -tobit(seed)
  seed = (seedLim > 0 and seedLim <= i) and i - seedLim or seed + i
  mt[i + 1] = seed
 end

 return mt
end

local M, LOWER_MASK, mag01 = 397, 0x7FFFFFFF, {0, 0x9908B0DF}

function getMTArrayFistSeed(seed)
 local mt = initializeMTArray(seed)
 local y = bor(band(mt[1], UPPER_MASK), band(mt[2], LOWER_MASK))
 mt[1] = bxor(mt[M + 1], rshift(y, 1), mag01[1 + band(y, 1)])

 return mt[1]
end

function setPredictedDateTime()
 local nextSeconds, nextMinutes, nextHours, nextDays = dateTime["秒"], dateTime["分钟"], dateTime["小时"], dateTime["日"]

 if dateTime["秒"] + 5 >= 60 then
  nextSeconds = (dateTime["秒"] + 5) - 60
  nextMinutes = dateTime["分钟"] + 1
 else
  nextSeconds = dateTime["秒"] + 5
  nextMinutes = dateTime["分钟"]
 end

 if nextMinutes == 60 then
  nextMinutes = nextMinutes - 60
  nextHours = dateTime["小时"] + 1
 else
  nextMinutes = dateTime["分钟"]
  nextHours = dateTime["小时"]
 end

 if nextHours == 24 then
  nextHours = nextHours - 24
  nextDays = dateTime["日"] + 1
 else
  nextHours = dateTime["小时"]
  nextDays = dateTime["日"]
 end

 return nextSeconds, nextMinutes, nextHours, nextDays
end

function buildSeedFromDelay(delay, predictSeedFlag)
 predictSeedFlag = predictSeedFlag or false

 local nextSeconds, nextMinutes, nextHours, nextDays = dateTime["秒"], dateTime["分钟"], dateTime["小时"], dateTime["日"]

 if predictSeedFlag then
  nextSeconds, nextMinutes, nextHours, nextDays = setPredictedDateTime()
 end

 local ab = ((dateTime["月"] * nextDays) + nextMinutes + nextSeconds) % 0x100
 local cd = nextHours
 local efgh = dateTime["年"] + delay
 local macAddr = 0x123456  -- DeSmuMe MAC 地址

 return ((ab * 0x1000000) + (cd * 0x10000) + efgh + macAddr) % 0x100000000
end

function convertToString(seed)
 return string.format("%08X", seed)
end

local cgearSeed, hitDelay , hitDate = 0, 0, "2000/01/01\n00:00:00"

function handleMTAdvances(mtSeed, delay)
 if prevMTSeed ~= mtSeed and delay > 200 then  -- 检查 RAM 中 MT 种子值变化时机
  local cgearSeedTest = buildSeedFromDelay(delay - 1)
  local cgearSeedTest2 = buildSeedFromDelay(delay - 2)
  local cgearGenerationFlag = convertToString(mtSeed) == convertToString(getMTArrayFistSeed(cgearSeedTest)) and 1 or
                              convertToString(mtSeed) == convertToString(getMTArrayFistSeed(cgearSeedTest2)) and 2 or nil

  if cgearGenerationFlag then
   mtCounter = 0
   cgearSeed = cgearGenerationFlag == 1 and cgearSeedTest or cgearSeedTest2
   hitDelay = delay - cgearGenerationFlag
   hitDate = string.format("20%s/%s/%s\n%s：%s：%s", dateTime["年"], dateTime["月"], dateTime["日"],
                           dateTime["小时"], dateTime["分钟"], dateTime["秒"])
  end

  mtCounter = mtCounter + 1
  prevMTSeed = mtSeed
 end
end

function LCRNG(s, mul, sum)
 local a = rshift(mul, 16) * (s % 0x10000) + rshift(s, 16) * (mul % 0x10000)
 local b = (mul % 0x10000) * (s % 0x10000) + (a % 0x10000) * 0x10000 + sum

 return b % 0x100000000
end

function LCRNGDistance(state0, state1)
 local mask = 1
 local dist = 0

 if state0 ~= state1 then
  for _, data in ipairs(JUMP_DATA) do
   local mult, add = unpack(data)

   if state0 == state1 then
    break
   end

   if band(bxor(state0, state1), mask) ~= 0 then
    state0 = LCRNG(state0, mult, add)
    dist = dist + mask
   end

   mask = lshift(mask, 1)
  end

  tempCurrentSeedLow = state1
 end

 return dist > 999 and dist - 0x100000000 or dist
end

local advances = 0

function getRngInfo()
 local mtSeed = read32Bit(mtSeedAddr)
 local currentHigh = read32Bit(currentSeedAddr + 0x4)
 local currentLow = read32Bit(currentSeedAddr)
 local mtIndex = read32Bit(mtIndexAddr)
 local delay = read32Bit(0x2FFFC3C)

 checkInitialSeedGeneration(mtSeed, currentHigh, currentLow, delay)
 handleMTAdvances(mtSeed, delay)

 advances = mtSeed == currentHigh and 0 or advances + LCRNGDistance(tempCurrentSeedLow, currentLow)
 local mtAdvances = (mtIndex - 624) + (mtCounter * 624)

 return currentHigh, currentLow, mtAdvances, delay
end

function showDateTime()
 if mode[index] ~= "无" then
  gui.box(193, 0, 254, 22, "#0000007F", "#0000007F")
  gui.text(194, 2, string.format("20%s/%s/%s", dateTime["年"], dateTime["月"], dateTime["日"]))
  gui.text(194, 13, string.format("%s：%s：%s", dateTime["小时"], dateTime["分钟"], dateTime["秒"]))
 end
end

local showCGearSeedInfoText = true

function getInitialSeedInfoInput()
 local key = input.get()

 if key["7"] or key["numpad7"] then
  showCGearSeedInfoText = false
 elseif key["8"] or key["numpad8"] then
  showCGearSeedInfoText = true
 end

 gui.box(1, 180, 122, 190, "#0000007F", "#0000007F")
 gui.text(2, 182, showCGearSeedInfoText and "7 - 隐藏 C-Gear 信息" or "8 - 显示 C-Gear 信息")
end

function showCGearSeedInfo(delay)
 if showCGearSeedInfoText then
  gui.box(1, 67, 164, 152, "#0000007F", "#0000007F")
  gui.text(2, 68, string.format("下一初始种子：%08X", buildSeedFromDelay(delay + 308, true)))
  gui.text(2, 79, string.format("下一延迟：%d", delay + 308))
  gui.text(2, 90, string.format("延迟：%d", delay))
  gui.text(2, 101, string.format("C-Gear 种子：%08X", cgearSeed))
  gui.text(2, 112, string.format("命中延迟：%d", hitDelay))
  gui.text(2, 123, string.format("命中日期/小时：\n%s", hitDate))
 end
end

local showRngInfoText = true

function showRngInfo()
 local currentSeedHigh, currentSeedLow, mtAdvances, delay = getRngInfo()

 if showRngInfoText and mode[index] ~= "无" then
  gui.box(1, 0, 182, 44, "#0000007F", "#0000007F")
  gui.text(2, 2, string.format("初始种子：%08X%08X", initialSeedHigh, initialSeedLow))
  gui.text(2, 13, string.format("当前种子：%08X%08X", currentSeedHigh, currentSeedLow))
  gui.text(2, 24, string.format("LCRNG 推进数：%d", advances))
  gui.text(2, 35, string.format("MT 推进数：%d", mtAdvances))

  showDateTime()

  if mode[index] == "C-Gear" then
   getInitialSeedInfoInput()
   showCGearSeedInfo(delay)
  end
 end
end

function getRngInfoInput()
 local key = input.get()

 if key["6"] or key["numpad6"] then
  showRngInfoText = true
 elseif key["5"] or key["numpad5"] then
  showRngInfoText = false
 end

 gui.text(152, 182, showRngInfoText and "5 - 隐藏 RNG 信息" or "6 - 显示 RNG 信息")
end

function getTrainerIDs()
 local trainerIDs = read32Bit(trainerIDsAddr)
 local TID = band(trainerIDs, 0xFFFF)
 local SID = rshift(trainerIDs, 16)

 return TID, SID
end

function showTrainerIDs()
 local trainerTID, trainerSID = getTrainerIDs()

 gui.text(194, -22, string.format("TID：%d", trainerTID))
 gui.text(194, -11, string.format("SID：%d", trainerSID))
end

local prevKeySlot, slotIndex = {}, 0

function getSlotInput()
 local leftSlotArrowColor = "gray"
 local rightSlotArrowColor = "gray"
 local key = input.get()

 if (key["3"] or key["numpad3"]) and (not prevKeySlot["3"] and not prevKeySlot["numpad3"]) then
  leftSlotArrowColor = "orange"
  slotIndex = slotIndex - 1 < 0 and 2 or slotIndex - 1
 elseif (key["4"] or key["numpad4"]) and (not prevKeySlot["4"] and not prevKeySlot["numpad4"]) then
  rightSlotArrowColor = "orange"
  slotIndex = slotIndex + 1 > 2 and 0 or slotIndex + 1
 end

 prevKeySlot = key
 gui.box(160, -191, 254, -180, "#0000007F", "#0000007F")
 drawArrowLeft(161, -189, leftSlotArrowColor)
 gui.text(169, -189, "3 - 4")
 drawArrowRight(207, -189, rightSlotArrowColor)
 gui.text(212, -189, "槽位："..slotIndex + 1)

 return slotIndex
end

function getOffset(offsetType, orderIndex)
 local offsets = {["成长"] = {0,0,0,0,0,0, 1,1,2,3,2,3, 1,1,2,3,2,3, 1,1,2,3,2,3},
                  ["攻击"] = {1,1,2,3,2,3, 0,0,0,0,0,0, 2,3,1,1,3,2, 2,3,1,1,3,2}}

 return offsets[offsetType][orderIndex]
end

function shinyCheck(PID, trainerTID, trainerSID)
 trainerTID = trainerTID or nil
 trainerSID = trainerSID or nil

 if not trainerTID then
  trainerTID, trainerSID = getTrainerIDs()
 end

 local lowPID = band(PID, 0xFFFF)
 local highPID = rshift(PID, 16)
 local shinyTypeValue = bxor(bxor(trainerTID, trainerSID), bxor(lowPID, highPID))

 if shinyTypeValue < 8 then
  return "green", shinyTypeValue == 0 and "（方块）" or "（星星）"
 end

 return nil, ""
end

function getBits(a, b, d)
 return rshift(a, b) % lshift(1, d)
end

function getIVs(ivsValue, isRoamer)
 local hpIV  = getBits(ivsValue, 0, 5)
 local atkIV = getBits(ivsValue, 5, 5)
 local defIV = getBits(ivsValue, 10, 5)
 local spdIV = isRoamer and getBits(ivsValue, 25, 5) or getBits(ivsValue, 15, 5)
 local spAtkIV = isRoamer and getBits(ivsValue, 15, 5) or getBits(ivsValue, 20, 5)
 local spDefIV = isRoamer and getBits(ivsValue, 20, 5) or getBits(ivsValue, 25, 5)

 return hpIV, atkIV, defIV, spAtkIV, spDefIV, spdIV
end

function getHPTypeAndPower(hpIV, atkIV, defIV, spAtkIV, spDefIV, spdIV)
 local hpType = floor(((band(hpIV, 1) + (2 * band(atkIV, 1)) + (4 * band(defIV, 1)) + (8 * band(spdIV, 1)) + (16 * band(spAtkIV, 1))
                + (32 * band(spDefIV, 1))) * 15) / 63)
 local hpPower = floor((((band(rshift(hpIV, 1), 1) + (2 * band(rshift(atkIV, 1), 1)) + (4 * band(rshift(defIV, 1), 1)) + (8 * band(rshift(spdIV, 1), 1))
                 + (16 * band(rshift(spAtkIV, 1), 1)) + (32 * band(rshift(spDefIV, 1), 1))) * 40) / 63)) + 30

 return hpType, hpPower
end

function getIVColor(value)
 if value >= 30 then
  return "green"
 elseif value >= 1 and value <= 5 then
  return "orange"
 elseif value < 1 then
  return "red"
 end

 return nil  -- IV 值从 6 到 29
end

function showIVsAndHP(ivsValue, isRoamer)
 isRoamer = isRoamer or nil

 local hpIV, atkIV, defIV, spAtkIV, spDefIV, spdIV = getIVs(ivsValue, isRoamer)
 local hpType, hpPower = getHPTypeAndPower(hpIV, atkIV, defIV, spAtkIV, spDefIV, spdIV)

 gui.text(2, -145, "个体值：")
 gui.text(32, -145, string.format("%02d", hpIV), getIVColor(hpIV))
 gui.text(44, -145, "/")
 gui.text(50, -145, string.format("%02d", atkIV), getIVColor(atkIV))
 gui.text(62, -145, "/")
 gui.text(68, -145, string.format("%02d", defIV), getIVColor(defIV))
 gui.text(80, -145, "/")
 gui.text(86, -145, string.format("%02d", spAtkIV), getIVColor(spAtkIV))
 gui.text(98, -145, "/")
 gui.text(104, -145, string.format("%02d", spDefIV), getIVColor(spDefIV))
 gui.text(116, -145, "/")
 gui.text(122, -145, string.format("%02d", spdIV), getIVColor(spdIV))

 gui.text(2, -134, "觉醒力量："..HPTypeNamesList[hpType + 1].." "..hpPower)
end

function showMoves(moveIndexesList)
 gui.text(2, -101, "招式："..moveNamesList[moveIndexesList[1] > 560 and 1 or moveIndexesList[1]])
 gui.text(2, -90, "招式："..moveNamesList[moveIndexesList[2] > 560 and 1 or moveIndexesList[2]])
 gui.text(2, -79, "招式："..moveNamesList[moveIndexesList[3] > 560 and 1 or moveIndexesList[3]])
 gui.text(2, -68, "招式："..moveNamesList[moveIndexesList[4] > 560 and 1 or moveIndexesList[4]])
end

function showPP(movePPList)
 gui.text(120, -101, "PP："..(movePPList[1] < 100 and movePPList[1] or 0))
 gui.text(120, -90, "PP："..(movePPList[2] < 100 and movePPList[2] or 0))
 gui.text(120, -79, "PP："..(movePPList[3] < 100 and movePPList[3] or 0))
 gui.text(120, -68, "PP："..(movePPList[4] < 100 and movePPList[4] or 0))
end

function showPokemonIDs(trainerTID, trainerSID)
 gui.text(194, -22, string.format("TID：%d", trainerTID))
 gui.text(194, -11, string.format("SID：%d", trainerSID))
end

function showInfo(pidAddr)
 local pokemonPID = read32Bit(pidAddr)
 local checksum = read16Bit(pidAddr + 0x6)
 local orderIndex = (rshift(band(pokemonPID, 0x3E000), 0xD) % 24) + 1
 local move = {}
 local movePP = {}
 local ivsPart = {}

 local growthOffset = getOffset("成长", orderIndex) * 32
 local attacksOffset = getOffset("攻击", orderIndex) * 32
 local prng = checksum

 for i = 1, getOffset("成长", orderIndex) do
  prng = LCRNG(prng, 0x5F748241, 0xCBA72510)  -- 16 个周期
 end

 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 local speciesDexIndex = bxor(read16Bit(pidAddr + growthOffset + 0x8), rshift(prng, 16))

 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 local heldItemIndex = bxor(read16Bit(pidAddr + growthOffset + 0xA), rshift(prng, 16)) + 1

 local OTID, OTSID = nil, nil

 if mode[index] == "宝可梦信息" then
  prng = LCRNG(prng, 0x41C64E6D, 0x6073)
  OTID = bxor(read16Bit(pidAddr + growthOffset + 0xC), rshift(prng, 16))
  prng = LCRNG(prng, 0x41C64E6D, 0x6073)
  OTSID = bxor(read16Bit(pidAddr + growthOffset + 0xE), rshift(prng, 16))
 else
  prng = LCRNG(prng, 0xC2A29A69, 0xE97E7B6A)  -- 2 个周期
 end

 local shinyTypeTextColor, shinyType = shinyCheck(pokemonPID, OTID, OTSID)

 prng = LCRNG(prng, 0x807DBCB5, 0x52713895)  -- 3 个周期
 local abilityIndex = bxor(read16Bit(pidAddr + growthOffset + 0x14), rshift(prng, 16))
 abilityIndex = getBits(abilityIndex, 8, 8)

 prng = checksum

 for i = 1, getOffset("攻击", orderIndex) do
  prng = LCRNG(prng, 0x5F748241, 0xCBA72510)  -- 16 个周期
 end

 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 move[1] = bxor(read16Bit(pidAddr + attacksOffset + 0x8), rshift(prng, 16)) + 1
 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 move[2] = bxor(read16Bit(pidAddr + attacksOffset + 0xA), rshift(prng, 16)) + 1
 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 move[3] = bxor(read16Bit(pidAddr + attacksOffset + 0xC), rshift(prng, 16)) + 1
 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 move[4] = bxor(read16Bit(pidAddr + attacksOffset + 0xE), rshift(prng, 16)) + 1

 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 local movePPAux = bxor(read16Bit(pidAddr + attacksOffset + 0x10), rshift(prng, 16))
 movePP[1] = getBits(movePPAux, 0, 8)
 movePP[2] = getBits(movePPAux, 8, 8)
 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 movePPAux = bxor(read16Bit(pidAddr + attacksOffset + 0x12), rshift(prng, 16))
 movePP[3] = getBits(movePPAux, 0, 8)
 movePP[4] = getBits(movePPAux, 8, 8)

 prng = LCRNG(prng, 0x807DBCB5, 0x52713895)  -- 3 个周期
 ivsPart[1] = bxor(read16Bit(pidAddr + attacksOffset + 0x18), rshift(prng, 16))
 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 ivsPart[2] = bxor(read16Bit(pidAddr + attacksOffset + 0x1A), rshift(prng, 16))
 local ivsValue = lshift(ivsPart[2], 16) + ivsPart[1]

 local isEgg = getBits(ivsValue, 30, 1) == 1

 prng = LCRNG(prng, 0x807DBCB5, 0x52713895)  -- 3 个周期
 local natureIndex = bxor(read16Bit(pidAddr + attacksOffset + 0x20), rshift(prng, 16))
 natureIndex = getBits(natureIndex, 8, 8) + 1

 prng = LCRNG(prng, 0x41C64E6D, 0x6073)
 local hiddenAbilityFlag = band(bxor(read16Bit(pidAddr + attacksOffset + 0x22), rshift(prng, 16)), 1) == 1

 if mode[index] ~= "培育" or isEgg then
  gui.text(2, -189, "种类："..speciesNamesList[(speciesDexIndex > 649 or speciesDexIndex < 1) and 1 or speciesDexIndex])
  gui.text(2, -178, "PID：")
  gui.text(32, -178, string.format("%08X%s", pokemonPID, shinyType), shinyTypeTextColor)
  gui.text(2, -167, "性格："..natureNamesList[(natureIndex > 25 or natureIndex == nil) and 1 or natureIndex])
  gui.text(2, -156, string.format("特性：%s (%s)", abilityNamesList[(abilityIndex > 164 or abilityIndex < 1) and 1 or abilityIndex],
           hiddenAbilityFlag and "H" or abilityIndex == pokemonAbilities[(speciesDexIndex > 649 or speciesDexIndex < 1) and 1 or speciesDexIndex][1] and "0" or "1"))

  showIVsAndHP(ivsValue)

  gui.text(2, -123, "携带道具："..itemNamesList[(heldItemIndex > 639) and 1 or heldItemIndex])

  showMoves(move)
  showPP(movePP)

  if mode[index] == "宝可梦信息" then
   showPokemonIDs(OTID, OTSID)
  end
 end
end

function showPartyEggInfo()
 local partySlotsCounter = read8Bit(partySlotsCounterAddr) - 1
 local lastPartySlotAddr = partyAddr + (partySlotsCounter * 0xDC)

 showInfo(lastPartySlotAddr)
end

function getRoamerInfo(roamerAddr)
 local isRoamerActive = read8Bit(roamerAddr + 0x12) == 1

 if isRoamerActive then
  local roamerMapIndex = read16Bit(roamerAddr)
  local roamerNatureIndex = read8Bit(roamerAddr + 0x2) + 1
  local roamerIVsValue = read32Bit(roamerAddr + 0x4)
  local roamerPID = read32Bit(roamerAddr + 0x8)
  local roamerShinyTypeTextColor, roamerShinyType = shinyCheck(roamerPID)
  local roamerSpeciesIndex = read16Bit(roamerAddr + 0xC)
  local roamerHP = read16Bit(roamerAddr + 0xE)
  local roamerLevel = read8Bit(roamerAddr + 0x10)
  local roamerStatusIndex = read8Bit(roamerAddr + 0x11)
  local roamerStatus = statusConditionNamesList[1]  -- 默认无异常状态
  local playerMapIndex = read16Bit(playerMapIndexAddr)

  if roamerStatusIndex == 0x1 then  -- 麻痹状态
   roamerStatus = statusConditionNamesList[2]
  elseif roamerStatusIndex == 0x2 then  -- 睡眠状态
   roamerStatus = statusConditionNamesList[3]
  elseif roamerStatusIndex == 0x3 then  -- 冰冻状态
   roamerStatus = statusConditionNamesList[4]
  elseif roamerStatusIndex == 0x4 then  -- 灼伤状态
   roamerStatus = statusConditionNamesList[5]
  elseif roamerStatusIndex == 0x5 then  -- 中毒状态
   roamerStatus = statusConditionNamesList[6]
  end

  return isRoamerActive, roamerMapIndex, (roamerNatureIndex > 25 or roamerNatureIndex == nil) and 1 or roamerNatureIndex, roamerIVsValue,
         roamerPID, roamerShinyTypeTextColor, roamerShinyType, (roamerSpeciesIndex > 649 or roamerSpeciesIndex < 1) and 1 or roamerSpeciesIndex,
         roamerHP, roamerLevel, roamerStatus, playerMapIndex
 end

 return nil
end

function showRoamerInfo(roamerAddr)
 local isRoamerActive, roamerMapIndex, roamerNatureIndex, roamerIVsValue, roamerPID, roamerShinyTypeTextColor,
       roamerShinyType, roamerSpeciesIndex, roamerHP, roamerLevel, roamerStatus, playerMapIndex = getRoamerInfo(roamerAddr)

 if isRoamerActive then
  gui.text(2, -189, "存在活跃游走宝可梦？ 是")
  gui.text(2, -178, "种类："..speciesNamesList[roamerSpeciesIndex])
  gui.text(2, -167, "PID：")
  gui.text(32, -167, string.format("%08X%s", roamerPID, roamerShinyType), roamerShinyTypeTextColor)
  gui.text(2, -156, "性格："..natureNamesList[roamerNatureIndex])
  showIVsAndHP(roamerIVsValue, true)
  gui.text(2, -123, "等级："..roamerLevel)
  gui.text(2, -112, "HP："..roamerHP)
  gui.text(2, -101, "异常状态："..roamerStatus)
  gui.text(2, -90, "当前位置：")
  gui.text(2, -79, (roamerMapIndex > 427 or roamerMapIndex < 1) and "" or locationNamesList[roamerMapIndex + 1],
                    roamerMapIndex == playerMapIndex and "green" or nil)
 else
  gui.text(2, -189, "存在活跃游走宝可梦？ 否")
 end
end

local prevKeyInfo, infoIndex, infoMode = {}, 1, {"礼物", "同行", "同行状态", "盒子", "盒子状态"}

function getInfoInput()
 local leftInfoArrowColor = "gray"
 local rightInfoArrowColor = "gray"
 local key = input.get()

 if (key["3"] or key["numpad3"]) and (not prevKeyInfo["3"] and not prevKeyInfo["numpad3"]) then
  leftInfoArrowColor = "orange"
  infoIndex = infoIndex - 1 < 1 and 5 or infoIndex - 1
 elseif (key["4"] or key["numpad4"]) and (not prevKeyInfo["4"] and not prevKeyInfo["numpad4"]) then
  rightInfoArrowColor = "orange"
  infoIndex = infoIndex + 1 > 5 and 1 or infoIndex + 1
 end

 prevKeyInfo = key
 gui.box(1, 67, 164, 88, "#0000007F", "#0000007F")
 gui.text(2, 68, "信息模式："..infoMode[infoIndex])
 drawArrowLeft(2, 79, leftInfoArrowColor)
 gui.text(10, 79, "3 - 4")
 drawArrowRight(48, 79, rightInfoArrowColor)
end

function showPokemonInfo()
 if infoMode[infoIndex] == "礼物" then
  local partySlotsCounter = read8Bit(partySlotsCounterAddr) - 1
  local lastPartySlotAddr = partyAddr + (partySlotsCounter * 0xDC)

  showInfo(lastPartySlotAddr)
 elseif infoMode[infoIndex] == "同行" then
  local partySelectedSlotIndex = read8Bit(partySelectedSlotIndexAddr)
  local partySelectedPokemonAddr = partyAddr + (partySelectedSlotIndex * 0xDC)

  showInfo(partySelectedPokemonAddr)
 elseif infoMode[infoIndex] == "同行状态" then
  local partyStatsSelectedSlotIndex = read8Bit(partyStatsSelectedSlotIndexAddr)
  local pokemonPartyStatsAddr = partyAddr + (partyStatsSelectedSlotIndex * 0xDC)

  showInfo(pokemonPartyStatsAddr)
 elseif infoMode[infoIndex] == "盒子" then
  local currBoxIndex = read8Bit(currBoxIndexAddr)
  local boxSelectedSlotIndex = read8Bit(boxSelectedSlotIndexAddr)
  local boxSelectedPokemonAddr = boxAddr + (0x88 * boxSelectedSlotIndex) + (0x10 * currBoxIndex) + (0x88 * currBoxIndex * 0x1E)

  showInfo(boxSelectedPokemonAddr)
 elseif infoMode[infoIndex] == "盒子状态" then
  showInfo(pokemonBoxStatsAddr)
 end
end

function createStateFile(statesFileName, stateSlot)
 local statesFile = io.open(statesFileName, "w")

 if statesFile then  -- 检查状态文件是否已正确创建
  for slotNumber = 1, 10 do
   if slotNumber == stateSlot then  -- 只写入已保存槽位所在行
    statesFile:write(string.format("%08X %08X %08X %d %d %08X %d %s\n", initialSeedHigh, initialSeedLow, tempCurrentSeedLow, advances,
                     mtCounter, cgearSeed, hitDelay, (hitDate:gsub("\n", " "))))
   else  -- 用空数据填充未保存状态的行
    statesFile:write("00000000 00000000 00000000 0 0 00000000 0 2000/01/01 00:00:00\n")
   end
  end

  statesFile:close()
  gui.text(2, 156, string.format("已保存状态到槽位 %s", stateSlot))
 end
end

function writeStateFile(statesFileName, stateSlot)
 local statesFile = io.open(statesFileName, "r")
 local line_num = 1
 local lines = ""

 for line in statesFile:lines() do
  if line_num == stateSlot then  -- 仅覆盖已保存槽位所在行
   line = string.format("%08X %08X %08X %d %d %08X %d %s", initialSeedHigh, initialSeedLow, tempCurrentSeedLow, advances,
                        mtCounter, cgearSeed, hitDelay, (hitDate:gsub("\n", " ")))
  end

  lines = lines..line.."\n"
  line_num = line_num + 1
 end

 statesFile:close()
 statesFile = io.open(statesFileName, "w")
 statesFile:write(lines)
 statesFile:close()
 gui.text(2, 156, string.format("已保存状态到槽位 %s", stateSlot))
end

function writeSaveStateValues(statesFileName, stateSlot)
 local statesFileCheck = io.open(statesFileName, "r")

 if not statesFileCheck then  -- 检查状态文件是否不存在
  createStateFile(statesFileName, stateSlot)
 else  -- 状态文件已存在
  statesFileCheck:close()
  writeStateFile(statesFileName, stateSlot)
 end
end

function setSaveStateValues(statesFileName, stateSlot)
 local statesFile = io.open(statesFileName, "r")

 if statesFile then
  local line_num = 1
  local values = {}

  for line in statesFile:lines() do
   if line_num == stateSlot then  -- 仅从已读取槽位所在行加载值
    for value in line:gmatch("%S+") do
     table.insert(values, value)
    end

    break
   end

   line_num = line_num + 1
  end

  statesFile:close()
  local prevInitialSeedHigh = initialSeedHigh
  initialSeedHigh = tonumber(values[1], 16)
  initialSeedLow = tonumber(values[2], 16)
  tempCurrentSeedLow = tonumber(values[3], 16)
  advances = tonumber(values[4])
  mtCounter = tonumber(values[5])
  cgearSeed = tonumber(values[6], 16)
  hitDelay = tonumber(values[7])
  hitDate = string.format("%s\n%s", values[8], values[9])
  prevMTSeed = read32Bit(mtSeedAddr)

  if prevInitialSeedHigh ~= initialSeedHigh and initialSeedHigh ~= 0 then
   print(string.format("初始种子：%08X%08X", initialSeedHigh, initialSeedLow))
  end

  gui.text(2, 156, string.format("已读取状态 %s", stateSlot))
 end
end

local prevStateKey = {}

function getSaveStateInput()
 local Fbuttons = {"F1", "F2", "F3", "F4", "F5", "F6", "F7", "F8", "F9", "F10"}
 local key = input.get()

 for slotNumber = 1, table.getn(Fbuttons) do
  if (key[Fbuttons[slotNumber]] and not prevStateKey[Fbuttons[slotNumber]]) then
   local statesFileName = string.format("states/%s_%s_states_values.txt", gameVersion, string.gsub(gameLanguage, "/", "_"))

   if (key["shift"]) then  -- 检查是否正在创建即时存档
    writeSaveStateValues(statesFileName, slotNumber)
   else  -- 正在读取状态
    setSaveStateValues(statesFileName, slotNumber)
   end

   break
  end
 end

 prevStateKey = key
end

function main()
 if not wrongGameVersion then
  getSaveStateInput()
  setBackgroundBoxes()
  setDateTime()
  getTabInput()
  showRngInfo()

  if mode[index] ~= "无" then
   getRngInfoInput()

   if mode[index] ~= "宝可梦信息" then
    showTrainerIDs()
   end
  end

  if mode[index] == "捕获" then
   showInfo(enemyAddr + (0xDC * getSlotInput()))
  elseif mode[index] == "培育" then
   showPartyEggInfo()
  elseif mode[index] == "游走宝可梦" then
   showRoamerInfo(roamerAddr)
  elseif mode[index] == "C-Gear" then
   showInfo(cgearEnemyAddr)
  elseif mode[index] == "宝可梦信息" then
   getInfoInput()
   showPokemonInfo()
  end
 end
end

gui.register(main)